RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
//###########################################################################
//
// FILE:    F2837xD_SWPrioritizedIsrLevels.h
//
// TITLE:   F28 Devices Software Prioritized Interrupt Service Routine
//          Level definitions.
//
//###########################################################################
// $TI Release: F2837xD Support Library v3.05.00.00 $
// $Release Date: Tue Jun 26 03:15:23 CDT 2018 $
// $Copyright:
// Copyright (C) 2013-2018 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef F2837xD_SW_PRIORITZIED_ISR_H
#define F2837xD_SW_PRIORITZIED_ISR_H

#ifdef __cplusplus
extern "C" {
#endif

//
// Interrupt Enable Register Allocation For F2837xD Devices:
//
// Interrupts can be enabled/disabled using the CPU interrupt enable register
// (IER) and the PIE interrupt enable registers (PIEIER1 to PIEIER12).
//
//
// Set "Global" Interrupt Priority Level (IER register):
//
// The user must set the appropriate priority level for each of the CPU
// interrupts. This is termed as the "global" priority. The priority level
// must be a number between 1 (highest) to 16 (lowest). A value of 0 must
// be entered for reserved interrupts or interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used.
//
// Note: The priority levels below are used to calculate the IER register
//       interrupt masks MINT1 to MINT16.
//
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 16 = lowest priority
//
#define    INT1PL      2        // Group1 Interrupts (PIEIER1)
#define    INT2PL      1        // Group2 Interrupts (PIEIER2)
#define    INT3PL      4        // Group3 Interrupts (PIEIER3)
#define    INT4PL      2        // Group4 Interrupts (PIEIER4)
#define    INT5PL      2        // Group5 Interrupts (PIEIER5)
#define    INT6PL      3        // Group6 Interrupts (PIEIER6)
#define    INT7PL      5        // Group7 Interrupts (PIEIER6)
#define    INT8PL      5        // Group8 Interrupts (PIEIER6)
#define    INT9PL      3        // Group9 Interrupts (PIEIER9)
#define    INT10PL     6        // Group10 Interrupts (PIEIER6)
#define    INT11PL     6        // Group11 Interrupts (PIEIER6)
#define    INT12PL     8        // Group12 Interrupts (PIEIER6)
#define    INT13PL     4        // XINT13
#define    INT14PL     4        // INT14 (TINT2)
#define    INT15PL     4        // DATALOG
#define    INT16PL     4        // RTOSINT

//
// Set "Group" Interrupt Priority Level (PIEIER1 to PIEIER12 registers):
//
// The user must set the appropriate priority level for each of the PIE
// interrupts. This is termed as the "group" priority. The priority level
// must be a number between 1 (highest) to 16 (lowest). A value of 0 must
// be entered for reserved interrupts or interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used:
//
// Note: The priority levels below are used to calculate the following
//       PIEIER register interrupt masks:
//                           MG1_1 to MG1_16
//                           MG2_1 to MG2_16
//                           MG3_1 to MG3_16
//                           MG4_1 to MG4_16
//                           MG5_1 to MG5_16
//                           MG6_1 to MG6_16
//                           MG7_1 to MG7_16
//                           MG8_1 to MG8_16
//                           MG9_1 to MG9_16
//                           MG10_1 to MG10_16
//                           MG11_1 to MG11_16
//                           MG12_1 to MG12_16
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 16  = lowest priority
//
#define G1_1PL        5        // ADCA1_INT
#define G1_2PL        3        // ADCB1_INT
#define G1_3PL        1        // ADCC1_INT
#define G1_4PL        4        // XINT1_INT
#define G1_5PL        4        // XINT2_INT
#define G1_6PL        1        // ADCD1_INT
#define G1_7PL        12        // TIMER0_INT
#define G1_8PL        5        // WAKE_INT
#define G1_9PL        0       // Reserved
#define G1_10PL        0       // Reserved
#define G1_11PL        0       // Reserved
#define G1_12PL        0       // Reserved
#define G1_13PL        8        // IPC1_INT
#define G1_14PL        13        // IPC2_INT
#define G1_15PL        15        // IPC3_INT
#define G1_16PL        9        // IPC4_INT

#define G2_1PL        13        // EPWM1_TZ_INT
#define G2_2PL        1        // EPWM2_TZ_INT
#define G2_3PL        1        // EPWM3_TZ_INT
#define G2_4PL        9        // EPWM4_TZ_INT
#define G2_5PL      3        // EPWM5_TZ_INT
#define G2_6PL        13        // EPWM6_TZ_INT
#define G2_7PL        9        // EPWM7_TZ_INT
#define G2_8PL        13        // EPWM8_TZ_INT
#define G2_9PL        15        // EPWM9_TZ_INT
#define G2_10PL        11        // EPWM10_TZ_INT
#define G2_11PL        7        // EPWM11_TZ_INT
#define G2_12PL        10        // EPWM12_TZ_INT
#define G2_13PL        0       // Reserved
#define G2_14PL        0       // Reserved
#define G2_15PL        0       // Reserved
#define G2_16PL        0       // Reserved

