RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#define G3_1PL        5        // EPWM1_INT
#define G3_2PL        9        // EPWM2_INT
#define G3_3PL        5        // EPWM3_INT
#define G3_4PL        2        // EPWM4_INT
#define G3_5PL        12        // EPWM5_INT
#define G3_6PL        4        // EPWM6_INT
#define G3_7PL        2        // EPWM7_INT
#define G3_8PL        13        // EPWM8_INT
#define G3_9PL        4        // EPWM9_INT
#define G3_10PL        12        // EPWM10_INT
#define G3_11PL        4        // EPWM11_INT
#define G3_12PL        14        // EPWM12_INT
#define G3_13PL        0        // Reserved
#define G3_14PL        0        // Reserved
#define G3_15PL        0        // Reserved
#define G3_16PL        0        // Reserved

#define G4_1PL        3        // ECAP1_INT
#define G4_2PL        3        // ECAP2_INT
#define G4_3PL        3        // ECAP3_INT
#define G4_4PL        6        // ECAP4_INT
#define G4_5PL        7        // ECAP5_INT
#define G4_6PL        7       // ECAP6_INT
#define G4_7PL        0       // Reserved
#define G4_8PL        0       // Reserved
#define G4_9PL        0       // Reserved
#define G4_10PL        0       // Reserved
#define G4_11PL        0       // Reserved
#define G4_12PL        0       // Reserved
#define G4_13PL        0       // Reserved
#define G4_14PL        0       // Reserved
#define G4_15PL        0       // Reserved
#define G4_16PL        0       // Reserved

#define G5_1PL        6        // EQEP1_INT
#define G5_2PL        5        // EQEP2_INT
#define G5_3PL        5        // EQEP3_INT
#define G5_4PL        1        // Reserved
#define G5_5PL        9        // CLB1_INT
#define G5_6PL        10        // CLB2_INT
#define G5_7PL        15        // CLB3_INT
#define G5_8PL        13        // CLB4_INT
#define G5_9PL        12        // SD1_INT
#define G5_10PL        9        // SD2_INT
#define G5_11PL        0       // Reserved
#define G5_12PL        0       // Reserved
#define G5_13PL        0       // Reserved
#define G5_14PL        0       // Reserved
#define G5_15PL        0       // Reserved
#define G5_16PL        0       // Reserved

#define G6_1PL        1        // SPIA_RX_INT
#define G6_2PL        7        // SPIA_TX_INT
#define G6_3PL        3        // SPIB_RX_INT
#define G6_4PL        3        // SPIB_TX_INT
#define G6_5PL        10        // MCBSPA_RX_INT
#define G6_6PL        7        // MCBSPA_TX_INT
#define G6_7PL        6        // MCBSPB_RX_INT
#define G6_8PL        13        // MCBSPB_TX_INT
#define G6_9PL        14        // SPIC_RX_INT
#define G6_10PL        3        // SPIC_TX_INT
#define G6_11PL        0        // Reserved
#define G6_12PL        0        // Reserved
#define G6_13PL        0        // Reserved
#define G6_14PL        0        // Reserved
#define G6_15PL        0        // Reserved
#define G6_16PL        0        // Reserved

#define G7_1PL        1        // DMA_CH1_INT
#define G7_2PL        11        // DMA_CH2_INT
#define G7_3PL        14        // DMA_CH3_INT
#define G7_4PL        3        // DMA_CH4_INT
#define G7_5PL        13        // DMA_CH5_INT
#define G7_6PL        14        // DMA_CH6_INT
#define G7_7PL        0       // Reserved
#define G7_8PL        0       // Reserved
#define G7_9PL        0       // Reserved
#define G7_10PL        0       // Reserved
#define G7_11PL        0       // Reserved
#define G7_12PL        0       // Reserved
#define G7_13PL        0       // Reserved
#define G7_14PL        0       // Reserved
#define G7_15PL        0       // Reserved
#define G7_16PL        0       // Reserved

#define G8_1PL        14        // I2CA_INT
#define G8_2PL        10        // I2CA_FIFO_INT
#define G8_3PL        11        // I2CB_INT
#define G8_4PL        9        // I2CB_FIFO_INT
#define G8_5PL        12        // SCIC_RX_INT
#define G8_6PL        2        // SCIC_TX_INT
#define G8_7PL        8        // SCID_RX_INT
#define G8_8PL        7        // SCID_TX_INT
#define G8_9PL        0        // Reserved
#define G8_10PL        0        // Reserved
#define G8_11PL        0        // Reserved
#define G8_12PL        0        // Reserved
#define G8_13PL        0        // Reserved
#define G8_14PL        0        // Reserved
#define G8_15PL        1        // UPPA_INT
#define G8_16PL        0        // Reserved

#define G9_1PL        12        // SCIA_RX_INT
#define G9_2PL        14        // SCIA_TX_INT
#define G9_3PL        11        // SCIB_RX_INT
#define G9_4PL        6        // SCIB_TX_INT
#define G9_5PL        14        // CANA0_INT
#define G9_6PL        10        // CANA1_INT
#define G9_7PL        10        // CANB0_INT
#define G9_8PL        5        // CANB1_INT
#define G9_9PL        0        // Reserved
#define G9_10PL        0        // Reserved
#define G9_11PL        0        // Reserved
#define G9_12PL        0        // Reserved
#define G9_13PL        0        // Reserved
#define G9_14PL        0        // Reserved
#define G9_15PL        12        // USBA_INT
#define G9_16PL        0        // Reserved

#define G10_1PL        14        // ADCA_EVT_INT
#define G10_2PL        3        // ADCA2_INT
#define G10_3PL        1        // ADCA3_INT
#define G10_4PL        12        // ADCA4_INT
#define G10_5PL        5        // ADCB_EVT_INT
#define G10_6PL        11        // ADCB2_INT
#define G10_7PL        12        // ADCB3_INT
#define G10_8PL        13        // ADCB4_INT
#define G10_9PL        7        // ADCC_EVT_INT
#define G10_10PL    8        // ADCC2_INT
#define G10_11PL    4        // ADCC3_INT
#define G10_12PL    9        // ADCC4_INT
#define G10_13PL    2        // ADCD_EVT_INT
#define G10_14PL    10        // ADCD2_INT
#define G10_15PL    11        // ADCD3_INT
#define G10_16PL    5        // ADCD4_INT

#define G11_1PL        9        // CLA1_1_INT
#define G11_2PL        6        // CLA1_2_INT
#define G11_3PL        9        // CLA1_3_INT
#define G11_4PL        9        // CLA1_4_INT
#define G11_5PL        6        // CLA1_5_INT
#define G11_6PL        13        // CLA1_6_INT
#define G11_7PL        10        // CLA1_7_INT
#define G11_8PL        15        // CLA1_8_INT
#define G11_9PL        0        // Reserved
#define G11_10PL    0        // Reserved
#define G11_11PL    0        // Reserved
#define G11_12PL    0        // Reserved
#define G11_13PL    0        // Reserved
#define G11_14PL    0        // Reserved
#define G11_15PL    0        // Reserved
#define G11_16PL    0        // Reserved

