RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#define G12_1PL        3        // XINT3_INT
#define G12_2PL        6        // XINT4_INT
#define G12_3PL        10        // XINT5_INT
#define G12_4PL        5        // Reserved
#define G12_5PL        2        // FMC_INT
#define G12_6PL        11        // VCU_INT
#define G12_7PL        14        // FPU_OVERFLOW_ISR
#define G12_8PL        14      // FPU_UNDERFLOW_ISR
#define G12_9PL        6       // EMIF_ERROR_ISR
#define G12_10PL    5       // RAM_CORRECTABLE_ERROR_ISR
#define G12_11PL    4       // FLASH_CORRECTABLE_ERROR_ISR
#define G12_12PL    12        // RAM_ACCESS_VIOLATION_INT
#define G12_13PL    8        // SYS_PLL_SLIP_INT
#define G12_14PL    2        // AUX_PLL_SLIP_INT
#define G12_15PL    12        // CLA_UNDERFLOW_INT
#define G12_16PL    2        // CLA_OVERFLOW_INT

//
// There should be no need to modify code below this line
//
// Automatically generate IER interrupt masks MINT1 to MINT16:
//
// Beginning of MINT1:
#if (INT1PL == 0)
#define  MINT1_1PL    ~(1 << 0)
#else
#define  MINT1_1PL    0xFFFF
#endif

#if (INT2PL >= INT1PL) || (INT2PL == 0)
#define  MINT1_2PL    ~(1 << 1)
#else
#define  MINT1_2PL    0xFFFF
#endif

#if (INT3PL >= INT1PL) || (INT3PL == 0)
#define  MINT1_3PL    ~(1 << 2)
#else
#define  MINT1_3PL    0xFFFF
#endif

#if (INT4PL >= INT1PL) || (INT4PL == 0)
#define  MINT1_4PL    ~(1 << 3)
#else
#define  MINT1_4PL    0xFFFF
#endif

#if (INT5PL >= INT1PL) || (INT5PL == 0)
#define  MINT1_5PL    ~(1 << 4)
#else
#define  MINT1_5PL    0xFFFF
#endif

#if (INT6PL >= INT1PL) || (INT6PL == 0)
#define  MINT1_6PL    ~(1 << 5)
#else
#define  MINT1_6PL    0xFFFF
#endif

#if (INT7PL >= INT1PL) || (INT7PL == 0)
#define  MINT1_7PL    ~(1 << 6)
#else
#define  MINT1_7PL    0xFFFF
#endif

#if (INT8PL >= INT1PL) || (INT8PL == 0)
#define  MINT1_8PL    ~(1 << 7)
#else
#define  MINT1_8PL    0xFFFF
#endif

#if (INT9PL >= INT1PL) || (INT9PL == 0)
#define  MINT1_9PL    ~(1 << 8)
#else
#define  MINT1_9PL    0xFFFF
#endif

#if (INT10PL >= INT1PL) || (INT10PL == 0)
#define  MINT1_10PL    ~(1 << 9)
#else
#define  MINT1_10PL    0xFFFF
#endif

#if (INT11PL >= INT1PL) || (INT11PL == 0)
#define  MINT1_11PL    ~(1 << 10)
#else
#define  MINT1_11PL    0xFFFF
#endif

#if (INT12PL >= INT1PL) || (INT12PL == 0)
#define  MINT1_12PL    ~(1 << 11)
#else
#define  MINT1_12PL    0xFFFF
#endif

#if (INT13PL >= INT1PL) || (INT13PL == 0)
#define  MINT1_13PL    ~(1 << 12)
#else
#define  MINT1_13PL    0xFFFF
#endif

#if (INT14PL >= INT1PL) || (INT14PL == 0)
#define  MINT1_14PL    ~(1 << 13)
#else
#define  MINT1_14PL    0xFFFF
#endif

#if (INT15PL >= INT1PL) || (INT15PL == 0)
#define  MINT1_15PL    ~(1 << 14)
#else
#define  MINT1_15PL    0xFFFF
#endif

#if (INT16PL >= INT1PL) || (INT16PL == 0)
#define  MINT1_16PL    ~(1 << 15)
#else
#define  MINT1_16PL    0xFFFF
#endif

#define  MINT1    (MINT1_1PL  & MINT1_2PL  & MINT1_3PL  & MINT1_4PL  & \
                   MINT1_5PL  & MINT1_6PL  & MINT1_7PL  & MINT1_8PL  & \
                   MINT1_9PL  & MINT1_10PL & MINT1_11PL & MINT1_12PL & \
                   MINT1_13PL & MINT1_14PL & MINT1_15PL & MINT1_16PL)
// End Of MINT1.

// Beginning of MINT2:
#if (INT1PL >= INT2PL) || (INT1PL == 0)
#define  MINT2_1PL    ~(1 << 0)
#else
#define  MINT2_1PL    0xFFFF
#endif

#if (INT2PL == 0)
#define  MINT2_2PL    ~(1 << 1)
#else
#define  MINT2_2PL    0xFFFF
#endif

#if (INT3PL >= INT2PL) || (INT3PL == 0)
#define  MINT2_3PL    ~(1 << 2)
#else
#define  MINT2_3PL    0xFFFF
#endif

#if (INT4PL >= INT2PL) || (INT4PL == 0)
#define  MINT2_4PL    ~(1 << 3)
#else
#define  MINT2_4PL    0xFFFF
#endif

#if (INT5PL >= INT2PL) || (INT5PL == 0)
#define  MINT2_5PL    ~(1 << 4)
#else
#define  MINT2_5PL    0xFFFF
#endif

#if (INT6PL >= INT2PL) || (INT6PL == 0)
#define  MINT2_6PL    ~(1 << 5)
#else
#define  MINT2_6PL    0xFFFF
#endif

#if (INT7PL >= INT2PL) || (INT7PL == 0)
#define  MINT2_7PL    ~(1 << 6)
#else
#define  MINT2_7PL    0xFFFF
#endif

#if (INT8PL >= INT2PL) || (INT8PL == 0)
#define  MINT2_8PL    ~(1 << 7)
#else
#define  MINT2_8PL    0xFFFF
#endif

#if (INT9PL >= INT2PL) || (INT9PL == 0)
#define  MINT2_9PL    ~(1 << 8)
#else
#define  MINT2_9PL    0xFFFF
#endif

#if (INT10PL >= INT2PL) || (INT10PL == 0)
#define  MINT2_10PL    ~(1 << 9)
#else
#define  MINT2_10PL    0xFFFF
#endif

#if (INT11PL >= INT2PL) || (INT11PL == 0)
#define  MINT2_11PL    ~(1 << 10)
#else
#define  MINT2_11PL    0xFFFF
#endif

#if (INT12PL >= INT2PL) || (INT12PL == 0)
#define  MINT2_12PL    ~(1 << 11)
#else
#define  MINT2_12PL    0xFFFF
#endif

#if (INT13PL >= INT2PL) || (INT13PL == 0)
#define  MINT2_13PL    ~(1 << 12)
#else
#define  MINT2_13PL    0xFFFF
#endif

#if (INT14PL >= INT2PL) || (INT14PL == 0)
#define  MINT2_14PL    ~(1 << 13)
#else
#define  MINT2_14PL    0xFFFF
#endif

#if (INT15PL >= INT2PL) || (INT15PL == 0)
#define  MINT2_15PL    ~(1 << 14)
#else
#define  MINT2_15PL    0xFFFF
#endif

#if (INT16PL >= INT2PL) || (INT16PL == 0)
#define  MINT2_16PL    ~(1 << 15)
#else
#define  MINT2_16PL    0xFFFF
#endif

#define  MINT2    (MINT2_1PL  & MINT2_2PL  & MINT2_3PL  & MINT2_4PL  & \
                   MINT2_5PL  & MINT2_6PL  & MINT2_7PL  & MINT2_8PL  & \
                   MINT2_9PL  & MINT2_10PL & MINT2_11PL & MINT2_12PL & \
                   MINT2_13PL & MINT2_14PL & MINT2_15PL & MINT2_16PL)
// End Of MINT2.

// Beginning of MINT3:
#if (INT1PL >= INT3PL) || (INT1PL == 0)
#define  MINT3_1PL    ~(1 << 0)
#else
#define  MINT3_1PL    0xFFFF
#endif

#if (INT2PL >= INT3PL) || (INT2PL == 0)
#define  MINT3_2PL    ~(1 << 1)
#else
#define  MINT3_2PL    0xFFFF
#endif

#if (INT3PL == 0)
#define  MINT3_3PL    ~(1 << 2)
#else
#define  MINT3_3PL    0xFFFF
#endif

#if (INT4PL >= INT3PL) || (INT4PL == 0)
#define  MINT3_4PL    ~(1 << 3)
#else
#define  MINT3_4PL    0xFFFF
#endif

#if (INT5PL >= INT3PL) || (INT5PL == 0)
#define  MINT3_5PL    ~(1 << 4)
#else
#define  MINT3_5PL    0xFFFF
#endif

#if (INT6PL >= INT3PL) || (INT6PL == 0)
#define  MINT3_6PL    ~(1 << 5)
#else
#define  MINT3_6PL    0xFFFF
#endif

#if (INT7PL >= INT3PL) || (INT7PL == 0)
#define  MINT3_7PL    ~(1 << 6)
#else
#define  MINT3_7PL    0xFFFF
#endif

#if (INT8PL >= INT3PL) || (INT8PL == 0)
#define  MINT3_8PL    ~(1 << 7)
#else
#define  MINT3_8PL    0xFFFF
#endif

#if (INT9PL >= INT3PL) || (INT9PL == 0)
#define  MINT3_9PL    ~(1 << 8)
#else
#define  MINT3_9PL    0xFFFF
#endif

