RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G3_13PL >= G3_1PL) || (G3_13PL == 0)
#define  MG3_1_113PL    ~(1 << 12)
#else
#define  MG3_1_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_1PL) || (G3_14PL == 0)
#define  MG3_1_114PL    ~(1 << 13)
#else
#define  MG3_1_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_1PL) || (G3_15PL == 0)
#define  MG3_1_115PL    ~(1 << 14)
#else
#define  MG3_1_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_1PL) || (G3_16PL == 0)
#define  MG3_1_116PL    ~(1 << 15)
#else
#define  MG3_1_116PL    0xFFFF
#endif

#define  MG3_1_11PL    0xFFFE
#define  MG3_1    (MG3_1_11PL & MG3_1_12PL & MG3_1_13PL & MG3_1_14PL & \
                    MG3_1_15PL & MG3_1_16PL & MG3_1_17PL & MG3_1_18PL & \
                    MG3_1_19PL & MG3_1_110PL & MG3_1_111PL & MG3_1_112PL & \
                    MG3_1_113PL & MG3_1_114PL & MG3_1_115PL & MG3_1_116PL)
// End of MG3_1:
// Beginning of MG32:
#if (G3_1PL >= G3_2PL) || (G3_1PL == 0)
#define  MG3_2_11PL    ~(1 << 0)
#else
#define  MG3_2_11PL    0xFFFF
#endif

#if (G3_3PL >= G3_2PL) || (G3_3PL == 0)
#define  MG3_2_13PL    ~(1 << 2)
#else
#define  MG3_2_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_2PL) || (G3_4PL == 0)
#define  MG3_2_14PL    ~(1 << 3)
#else
#define  MG3_2_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_2PL) || (G3_5PL == 0)
#define  MG3_2_15PL    ~(1 << 4)
#else
#define  MG3_2_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_2PL) || (G3_6PL == 0)
#define  MG3_2_16PL    ~(1 << 5)
#else
#define  MG3_2_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_2PL) || (G3_7PL == 0)
#define  MG3_2_17PL    ~(1 << 6)
#else
#define  MG3_2_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_2PL) || (G3_8PL == 0)
#define  MG3_2_18PL    ~(1 << 7)
#else
#define  MG3_2_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_2PL) || (G3_9PL == 0)
#define  MG3_2_19PL    ~(1 << 8)
#else
#define  MG3_2_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_2PL) || (G3_10PL == 0)
#define  MG3_2_110PL    ~(1 << 9)
#else
#define  MG3_2_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_2PL) || (G3_11PL == 0)
#define  MG3_2_111PL    ~(1 << 10)
#else
#define  MG3_2_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_2PL) || (G3_12PL == 0)
#define  MG3_2_112PL    ~(1 << 11)
#else
#define  MG3_2_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_2PL) || (G3_13PL == 0)
#define  MG3_2_113PL    ~(1 << 12)
#else
#define  MG3_2_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_2PL) || (G3_14PL == 0)
#define  MG3_2_114PL    ~(1 << 13)
#else
#define  MG3_2_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_2PL) || (G3_15PL == 0)
#define  MG3_2_115PL    ~(1 << 14)
#else
#define  MG3_2_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_2PL) || (G3_16PL == 0)
#define  MG3_2_116PL    ~(1 << 15)
#else
#define  MG3_2_116PL    0xFFFF
#endif

#define  MG3_2_12PL    0xFFFD
#define  MG3_2    (MG3_2_11PL & MG3_2_12PL & MG3_2_13PL & MG3_2_14PL & \
                    MG3_2_15PL & MG3_2_16PL & MG3_2_17PL & MG3_2_18PL & \
                    MG3_2_19PL & MG3_2_110PL & MG3_2_111PL & MG3_2_112PL & \
                    MG3_2_113PL & MG3_2_114PL & MG3_2_115PL & MG3_2_116PL)
// End of MG3_2:
// Beginning of MG33:
#if (G3_1PL >= G3_3PL) || (G3_1PL == 0)
#define  MG3_3_11PL    ~(1 << 0)
#else
#define  MG3_3_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_3PL) || (G3_2PL == 0)
#define  MG3_3_12PL    ~(1 << 1)
#else
#define  MG3_3_12PL    0xFFFF
#endif

#if (G3_4PL >= G3_3PL) || (G3_4PL == 0)
#define  MG3_3_14PL    ~(1 << 3)
#else
#define  MG3_3_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_3PL) || (G3_5PL == 0)
#define  MG3_3_15PL    ~(1 << 4)
#else
#define  MG3_3_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_3PL) || (G3_6PL == 0)
#define  MG3_3_16PL    ~(1 << 5)
#else
#define  MG3_3_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_3PL) || (G3_7PL == 0)
#define  MG3_3_17PL    ~(1 << 6)
#else
#define  MG3_3_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_3PL) || (G3_8PL == 0)
#define  MG3_3_18PL    ~(1 << 7)
#else
#define  MG3_3_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_3PL) || (G3_9PL == 0)
#define  MG3_3_19PL    ~(1 << 8)
#else
#define  MG3_3_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_3PL) || (G3_10PL == 0)
#define  MG3_3_110PL    ~(1 << 9)
#else
#define  MG3_3_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_3PL) || (G3_11PL == 0)
#define  MG3_3_111PL    ~(1 << 10)
#else
#define  MG3_3_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_3PL) || (G3_12PL == 0)
#define  MG3_3_112PL    ~(1 << 11)
#else
#define  MG3_3_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_3PL) || (G3_13PL == 0)
#define  MG3_3_113PL    ~(1 << 12)
#else
#define  MG3_3_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_3PL) || (G3_14PL == 0)
#define  MG3_3_114PL    ~(1 << 13)
#else
#define  MG3_3_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_3PL) || (G3_15PL == 0)
#define  MG3_3_115PL    ~(1 << 14)
#else
#define  MG3_3_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_3PL) || (G3_16PL == 0)
#define  MG3_3_116PL    ~(1 << 15)
#else
#define  MG3_3_116PL    0xFFFF
#endif

#define  MG3_3_13PL    0xFFFB
#define  MG3_3    (MG3_3_11PL & MG3_3_12PL & MG3_3_13PL & MG3_3_14PL & \
                    MG3_3_15PL & MG3_3_16PL & MG3_3_17PL & MG3_3_18PL & \
                    MG3_3_19PL & MG3_3_110PL & MG3_3_111PL & MG3_3_112PL & \
                    MG3_3_113PL & MG3_3_114PL & MG3_3_115PL & MG3_3_116PL)
// End of MG3_3:
// Beginning of MG34:
#if (G3_1PL >= G3_4PL) || (G3_1PL == 0)
#define  MG3_4_11PL    ~(1 << 0)
#else
#define  MG3_4_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_4PL) || (G3_2PL == 0)
#define  MG3_4_12PL    ~(1 << 1)
#else
#define  MG3_4_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_4PL) || (G3_3PL == 0)
#define  MG3_4_13PL    ~(1 << 2)
#else
#define  MG3_4_13PL    0xFFFF
#endif

#if (G3_5PL >= G3_4PL) || (G3_5PL == 0)
#define  MG3_4_15PL    ~(1 << 4)
#else
#define  MG3_4_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_4PL) || (G3_6PL == 0)
#define  MG3_4_16PL    ~(1 << 5)
#else
#define  MG3_4_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_4PL) || (G3_7PL == 0)
#define  MG3_4_17PL    ~(1 << 6)
#else
#define  MG3_4_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_4PL) || (G3_8PL == 0)
#define  MG3_4_18PL    ~(1 << 7)
#else
#define  MG3_4_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_4PL) || (G3_9PL == 0)
#define  MG3_4_19PL    ~(1 << 8)
#else
#define  MG3_4_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_4PL) || (G3_10PL == 0)
#define  MG3_4_110PL    ~(1 << 9)
#else
#define  MG3_4_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_4PL) || (G3_11PL == 0)
#define  MG3_4_111PL    ~(1 << 10)
#else
#define  MG3_4_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_4PL) || (G3_12PL == 0)
#define  MG3_4_112PL    ~(1 << 11)
#else
#define  MG3_4_112PL    0xFFFF
#endif

