RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G5_7PL >= G5_12PL) || (G5_7PL == 0)
#define  MG5_12_17PL    ~(1 << 6)
#else
#define  MG5_12_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_12PL) || (G5_8PL == 0)
#define  MG5_12_18PL    ~(1 << 7)
#else
#define  MG5_12_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_12PL) || (G5_9PL == 0)
#define  MG5_12_19PL    ~(1 << 8)
#else
#define  MG5_12_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_12PL) || (G5_10PL == 0)
#define  MG5_12_110PL    ~(1 << 9)
#else
#define  MG5_12_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_12PL) || (G5_11PL == 0)
#define  MG5_12_111PL    ~(1 << 10)
#else
#define  MG5_12_111PL    0xFFFF
#endif

#if (G5_13PL >= G5_12PL) || (G5_13PL == 0)
#define  MG5_12_113PL    ~(1 << 12)
#else
#define  MG5_12_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_12PL) || (G5_14PL == 0)
#define  MG5_12_114PL    ~(1 << 13)
#else
#define  MG5_12_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_12PL) || (G5_15PL == 0)
#define  MG5_12_115PL    ~(1 << 14)
#else
#define  MG5_12_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_12PL) || (G5_16PL == 0)
#define  MG5_12_116PL    ~(1 << 15)
#else
#define  MG5_12_116PL    0xFFFF
#endif

#define  MG5_12_112PL    0xF7FF
#define  MG5_12    (MG5_12_11PL & MG5_12_12PL & MG5_12_13PL & MG5_12_14PL & \
                    MG5_12_15PL & MG5_12_16PL & MG5_12_17PL & MG5_12_18PL & \
                    MG5_12_19PL & MG5_12_110PL & MG5_12_111PL & MG5_12_112PL & \
                    MG5_12_113PL & MG5_12_114PL & MG5_12_115PL & MG5_12_116PL)
// End of MG5_12:
// Beginning of MG513:
#if (G5_1PL >= G5_13PL) || (G5_1PL == 0)
#define  MG5_13_11PL    ~(1 << 0)
#else
#define  MG5_13_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_13PL) || (G5_2PL == 0)
#define  MG5_13_12PL    ~(1 << 1)
#else
#define  MG5_13_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_13PL) || (G5_3PL == 0)
#define  MG5_13_13PL    ~(1 << 2)
#else
#define  MG5_13_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_13PL) || (G5_4PL == 0)
#define  MG5_13_14PL    ~(1 << 3)
#else
#define  MG5_13_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_13PL) || (G5_5PL == 0)
#define  MG5_13_15PL    ~(1 << 4)
#else
#define  MG5_13_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_13PL) || (G5_6PL == 0)
#define  MG5_13_16PL    ~(1 << 5)
#else
#define  MG5_13_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_13PL) || (G5_7PL == 0)
#define  MG5_13_17PL    ~(1 << 6)
#else
#define  MG5_13_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_13PL) || (G5_8PL == 0)
#define  MG5_13_18PL    ~(1 << 7)
#else
#define  MG5_13_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_13PL) || (G5_9PL == 0)
#define  MG5_13_19PL    ~(1 << 8)
#else
#define  MG5_13_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_13PL) || (G5_10PL == 0)
#define  MG5_13_110PL    ~(1 << 9)
#else
#define  MG5_13_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_13PL) || (G5_11PL == 0)
#define  MG5_13_111PL    ~(1 << 10)
#else
#define  MG5_13_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_13PL) || (G5_12PL == 0)
#define  MG5_13_112PL    ~(1 << 11)
#else
#define  MG5_13_112PL    0xFFFF
#endif

#if (G5_14PL >= G5_13PL) || (G5_14PL == 0)
#define  MG5_13_114PL    ~(1 << 13)
#else
#define  MG5_13_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_13PL) || (G5_15PL == 0)
#define  MG5_13_115PL    ~(1 << 14)
#else
#define  MG5_13_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_13PL) || (G5_16PL == 0)
#define  MG5_13_116PL    ~(1 << 15)
#else
#define  MG5_13_116PL    0xFFFF
#endif

#define  MG5_13_113PL    0xEFFF
#define  MG5_13    (MG5_13_11PL & MG5_13_12PL & MG5_13_13PL & MG5_13_14PL & \
                    MG5_13_15PL & MG5_13_16PL & MG5_13_17PL & MG5_13_18PL & \
                    MG5_13_19PL & MG5_13_110PL & MG5_13_111PL & MG5_13_112PL & \
                    MG5_13_113PL & MG5_13_114PL & MG5_13_115PL & MG5_13_116PL)
// End of MG5_13:
// Beginning of MG514:
#if (G5_1PL >= G5_14PL) || (G5_1PL == 0)
#define  MG5_14_11PL    ~(1 << 0)
#else
#define  MG5_14_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_14PL) || (G5_2PL == 0)
#define  MG5_14_12PL    ~(1 << 1)
#else
#define  MG5_14_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_14PL) || (G5_3PL == 0)
#define  MG5_14_13PL    ~(1 << 2)
#else
#define  MG5_14_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_14PL) || (G5_4PL == 0)
#define  MG5_14_14PL    ~(1 << 3)
#else
#define  MG5_14_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_14PL) || (G5_5PL == 0)
#define  MG5_14_15PL    ~(1 << 4)
#else
#define  MG5_14_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_14PL) || (G5_6PL == 0)
#define  MG5_14_16PL    ~(1 << 5)
#else
#define  MG5_14_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_14PL) || (G5_7PL == 0)
#define  MG5_14_17PL    ~(1 << 6)
#else
#define  MG5_14_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_14PL) || (G5_8PL == 0)
#define  MG5_14_18PL    ~(1 << 7)
#else
#define  MG5_14_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_14PL) || (G5_9PL == 0)
#define  MG5_14_19PL    ~(1 << 8)
#else
#define  MG5_14_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_14PL) || (G5_10PL == 0)
#define  MG5_14_110PL    ~(1 << 9)
#else
#define  MG5_14_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_14PL) || (G5_11PL == 0)
#define  MG5_14_111PL    ~(1 << 10)
#else
#define  MG5_14_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_14PL) || (G5_12PL == 0)
#define  MG5_14_112PL    ~(1 << 11)
#else
#define  MG5_14_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_14PL) || (G5_13PL == 0)
#define  MG5_14_113PL    ~(1 << 12)
#else
#define  MG5_14_113PL    0xFFFF
#endif

#if (G5_15PL >= G5_14PL) || (G5_15PL == 0)
#define  MG5_14_115PL    ~(1 << 14)
#else
#define  MG5_14_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_14PL) || (G5_16PL == 0)
#define  MG5_14_116PL    ~(1 << 15)
#else
#define  MG5_14_116PL    0xFFFF
#endif

#define  MG5_14_114PL    0xDFFF
#define  MG5_14    (MG5_14_11PL & MG5_14_12PL & MG5_14_13PL & MG5_14_14PL & \
                    MG5_14_15PL & MG5_14_16PL & MG5_14_17PL & MG5_14_18PL & \
                    MG5_14_19PL & MG5_14_110PL & MG5_14_111PL & MG5_14_112PL & \
                    MG5_14_113PL & MG5_14_114PL & MG5_14_115PL & MG5_14_116PL)
// End of MG5_14:
// Beginning of MG515:
#if (G5_1PL >= G5_15PL) || (G5_1PL == 0)
#define  MG5_15_11PL    ~(1 << 0)
#else
#define  MG5_15_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_15PL) || (G5_2PL == 0)
#define  MG5_15_12PL    ~(1 << 1)
#else
#define  MG5_15_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_15PL) || (G5_3PL == 0)
#define  MG5_15_13PL    ~(1 << 2)
#else
#define  MG5_15_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_15PL) || (G5_4PL == 0)
#define  MG5_15_14PL    ~(1 << 3)
#else
#define  MG5_15_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_15PL) || (G5_5PL == 0)
#define  MG5_15_15PL    ~(1 << 4)
#else
#define  MG5_15_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_15PL) || (G5_6PL == 0)
#define  MG5_15_16PL    ~(1 << 5)
#else
#define  MG5_15_16PL    0xFFFF
#endif

