RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G7_16PL >= G7_12PL) || (G7_16PL == 0)
#define  MG7_12_116PL    ~(1 << 15)
#else
#define  MG7_12_116PL    0xFFFF
#endif

#define  MG7_12_112PL    0xF7FF
#define  MG7_12    (MG7_12_11PL & MG7_12_12PL & MG7_12_13PL & MG7_12_14PL & \
                    MG7_12_15PL & MG7_12_16PL & MG7_12_17PL & MG7_12_18PL & \
                    MG7_12_19PL & MG7_12_110PL & MG7_12_111PL & MG7_12_112PL & \
                    MG7_12_113PL & MG7_12_114PL & MG7_12_115PL & MG7_12_116PL)
// End of MG7_12:
// Beginning of MG713:
#if (G7_1PL >= G7_13PL) || (G7_1PL == 0)
#define  MG7_13_11PL    ~(1 << 0)
#else
#define  MG7_13_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_13PL) || (G7_2PL == 0)
#define  MG7_13_12PL    ~(1 << 1)
#else
#define  MG7_13_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_13PL) || (G7_3PL == 0)
#define  MG7_13_13PL    ~(1 << 2)
#else
#define  MG7_13_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_13PL) || (G7_4PL == 0)
#define  MG7_13_14PL    ~(1 << 3)
#else
#define  MG7_13_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_13PL) || (G7_5PL == 0)
#define  MG7_13_15PL    ~(1 << 4)
#else
#define  MG7_13_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_13PL) || (G7_6PL == 0)
#define  MG7_13_16PL    ~(1 << 5)
#else
#define  MG7_13_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_13PL) || (G7_7PL == 0)
#define  MG7_13_17PL    ~(1 << 6)
#else
#define  MG7_13_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_13PL) || (G7_8PL == 0)
#define  MG7_13_18PL    ~(1 << 7)
#else
#define  MG7_13_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_13PL) || (G7_9PL == 0)
#define  MG7_13_19PL    ~(1 << 8)
#else
#define  MG7_13_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_13PL) || (G7_10PL == 0)
#define  MG7_13_110PL    ~(1 << 9)
#else
#define  MG7_13_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_13PL) || (G7_11PL == 0)
#define  MG7_13_111PL    ~(1 << 10)
#else
#define  MG7_13_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_13PL) || (G7_12PL == 0)
#define  MG7_13_112PL    ~(1 << 11)
#else
#define  MG7_13_112PL    0xFFFF
#endif

#if (G7_14PL >= G7_13PL) || (G7_14PL == 0)
#define  MG7_13_114PL    ~(1 << 13)
#else
#define  MG7_13_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_13PL) || (G7_15PL == 0)
#define  MG7_13_115PL    ~(1 << 14)
#else
#define  MG7_13_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_13PL) || (G7_16PL == 0)
#define  MG7_13_116PL    ~(1 << 15)
#else
#define  MG7_13_116PL    0xFFFF
#endif

#define  MG7_13_113PL    0xEFFF
#define  MG7_13    (MG7_13_11PL & MG7_13_12PL & MG7_13_13PL & MG7_13_14PL & \
                    MG7_13_15PL & MG7_13_16PL & MG7_13_17PL & MG7_13_18PL & \
                    MG7_13_19PL & MG7_13_110PL & MG7_13_111PL & MG7_13_112PL & \
                    MG7_13_113PL & MG7_13_114PL & MG7_13_115PL & MG7_13_116PL)
// End of MG7_13:
// Beginning of MG714:
#if (G7_1PL >= G7_14PL) || (G7_1PL == 0)
#define  MG7_14_11PL    ~(1 << 0)
#else
#define  MG7_14_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_14PL) || (G7_2PL == 0)
#define  MG7_14_12PL    ~(1 << 1)
#else
#define  MG7_14_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_14PL) || (G7_3PL == 0)
#define  MG7_14_13PL    ~(1 << 2)
#else
#define  MG7_14_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_14PL) || (G7_4PL == 0)
#define  MG7_14_14PL    ~(1 << 3)
#else
#define  MG7_14_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_14PL) || (G7_5PL == 0)
#define  MG7_14_15PL    ~(1 << 4)
#else
#define  MG7_14_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_14PL) || (G7_6PL == 0)
#define  MG7_14_16PL    ~(1 << 5)
#else
#define  MG7_14_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_14PL) || (G7_7PL == 0)
#define  MG7_14_17PL    ~(1 << 6)
#else
#define  MG7_14_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_14PL) || (G7_8PL == 0)
#define  MG7_14_18PL    ~(1 << 7)
#else
#define  MG7_14_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_14PL) || (G7_9PL == 0)
#define  MG7_14_19PL    ~(1 << 8)
#else
#define  MG7_14_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_14PL) || (G7_10PL == 0)
#define  MG7_14_110PL    ~(1 << 9)
#else
#define  MG7_14_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_14PL) || (G7_11PL == 0)
#define  MG7_14_111PL    ~(1 << 10)
#else
#define  MG7_14_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_14PL) || (G7_12PL == 0)
#define  MG7_14_112PL    ~(1 << 11)
#else
#define  MG7_14_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_14PL) || (G7_13PL == 0)
#define  MG7_14_113PL    ~(1 << 12)
#else
#define  MG7_14_113PL    0xFFFF
#endif

#if (G7_15PL >= G7_14PL) || (G7_15PL == 0)
#define  MG7_14_115PL    ~(1 << 14)
#else
#define  MG7_14_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_14PL) || (G7_16PL == 0)
#define  MG7_14_116PL    ~(1 << 15)
#else
#define  MG7_14_116PL    0xFFFF
#endif

#define  MG7_14_114PL    0xDFFF
#define  MG7_14    (MG7_14_11PL & MG7_14_12PL & MG7_14_13PL & MG7_14_14PL & \
                    MG7_14_15PL & MG7_14_16PL & MG7_14_17PL & MG7_14_18PL & \
                    MG7_14_19PL & MG7_14_110PL & MG7_14_111PL & MG7_14_112PL & \
                    MG7_14_113PL & MG7_14_114PL & MG7_14_115PL & MG7_14_116PL)
// End of MG7_14:
// Beginning of MG715:
#if (G7_1PL >= G7_15PL) || (G7_1PL == 0)
#define  MG7_15_11PL    ~(1 << 0)
#else
#define  MG7_15_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_15PL) || (G7_2PL == 0)
#define  MG7_15_12PL    ~(1 << 1)
#else
#define  MG7_15_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_15PL) || (G7_3PL == 0)
#define  MG7_15_13PL    ~(1 << 2)
#else
#define  MG7_15_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_15PL) || (G7_4PL == 0)
#define  MG7_15_14PL    ~(1 << 3)
#else
#define  MG7_15_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_15PL) || (G7_5PL == 0)
#define  MG7_15_15PL    ~(1 << 4)
#else
#define  MG7_15_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_15PL) || (G7_6PL == 0)
#define  MG7_15_16PL    ~(1 << 5)
#else
#define  MG7_15_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_15PL) || (G7_7PL == 0)
#define  MG7_15_17PL    ~(1 << 6)
#else
#define  MG7_15_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_15PL) || (G7_8PL == 0)
#define  MG7_15_18PL    ~(1 << 7)
#else
#define  MG7_15_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_15PL) || (G7_9PL == 0)
#define  MG7_15_19PL    ~(1 << 8)
#else
#define  MG7_15_19PL    0xFFFF
#endif

