RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G7_10PL >= G7_15PL) || (G7_10PL == 0)
#define  MG7_15_110PL    ~(1 << 9)
#else
#define  MG7_15_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_15PL) || (G7_11PL == 0)
#define  MG7_15_111PL    ~(1 << 10)
#else
#define  MG7_15_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_15PL) || (G7_12PL == 0)
#define  MG7_15_112PL    ~(1 << 11)
#else
#define  MG7_15_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_15PL) || (G7_13PL == 0)
#define  MG7_15_113PL    ~(1 << 12)
#else
#define  MG7_15_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_15PL) || (G7_14PL == 0)
#define  MG7_15_114PL    ~(1 << 13)
#else
#define  MG7_15_114PL    0xFFFF
#endif

#if (G7_16PL >= G7_15PL) || (G7_16PL == 0)
#define  MG7_15_116PL    ~(1 << 15)
#else
#define  MG7_15_116PL    0xFFFF
#endif

#define  MG7_15_115PL    0xBFFF
#define  MG7_15    (MG7_15_11PL & MG7_15_12PL & MG7_15_13PL & MG7_15_14PL & \
                    MG7_15_15PL & MG7_15_16PL & MG7_15_17PL & MG7_15_18PL & \
                    MG7_15_19PL & MG7_15_110PL & MG7_15_111PL & MG7_15_112PL & \
                    MG7_15_113PL & MG7_15_114PL & MG7_15_115PL & MG7_15_116PL)
// End of MG7_15:
// Beginning of MG716:
#if (G7_1PL >= G7_16PL) || (G7_1PL == 0)
#define  MG7_16_11PL    ~(1 << 0)
#else
#define  MG7_16_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_16PL) || (G7_2PL == 0)
#define  MG7_16_12PL    ~(1 << 1)
#else
#define  MG7_16_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_16PL) || (G7_3PL == 0)
#define  MG7_16_13PL    ~(1 << 2)
#else
#define  MG7_16_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_16PL) || (G7_4PL == 0)
#define  MG7_16_14PL    ~(1 << 3)
#else
#define  MG7_16_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_16PL) || (G7_5PL == 0)
#define  MG7_16_15PL    ~(1 << 4)
#else
#define  MG7_16_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_16PL) || (G7_6PL == 0)
#define  MG7_16_16PL    ~(1 << 5)
#else
#define  MG7_16_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_16PL) || (G7_7PL == 0)
#define  MG7_16_17PL    ~(1 << 6)
#else
#define  MG7_16_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_16PL) || (G7_8PL == 0)
#define  MG7_16_18PL    ~(1 << 7)
#else
#define  MG7_16_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_16PL) || (G7_9PL == 0)
#define  MG7_16_19PL    ~(1 << 8)
#else
#define  MG7_16_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_16PL) || (G7_10PL == 0)
#define  MG7_16_110PL    ~(1 << 9)
#else
#define  MG7_16_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_16PL) || (G7_11PL == 0)
#define  MG7_16_111PL    ~(1 << 10)
#else
#define  MG7_16_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_16PL) || (G7_12PL == 0)
#define  MG7_16_112PL    ~(1 << 11)
#else
#define  MG7_16_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_16PL) || (G7_13PL == 0)
#define  MG7_16_113PL    ~(1 << 12)
#else
#define  MG7_16_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_16PL) || (G7_14PL == 0)
#define  MG7_16_114PL    ~(1 << 13)
#else
#define  MG7_16_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_16PL) || (G7_15PL == 0)
#define  MG7_16_115PL    ~(1 << 14)
#else
#define  MG7_16_115PL    0xFFFF
#endif

#define  MG7_16_116PL    0x7FFF
#define  MG7_16    (MG7_16_11PL & MG7_16_12PL & MG7_16_13PL & MG7_16_14PL & \
                    MG7_16_15PL & MG7_16_16PL & MG7_16_17PL & MG7_16_18PL & \
                    MG7_16_19PL & MG7_16_110PL & MG7_16_111PL & MG7_16_112PL & \
                    MG7_16_113PL & MG7_16_114PL & MG7_16_115PL & MG7_16_116PL)
// End of MG7_16:


//
// Automatically generate PIEIER8 interrupt masks MG81 to MG816:
//

// Beginning of MG81:
#if (G8_2PL >= G8_1PL) || (G8_2PL == 0)
#define  MG8_1_12PL    ~(1 << 1)
#else
#define  MG8_1_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_1PL) || (G8_3PL == 0)
#define  MG8_1_13PL    ~(1 << 2)
#else
#define  MG8_1_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_1PL) || (G8_4PL == 0)
#define  MG8_1_14PL    ~(1 << 3)
#else
#define  MG8_1_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_1PL) || (G8_5PL == 0)
#define  MG8_1_15PL    ~(1 << 4)
#else
#define  MG8_1_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_1PL) || (G8_6PL == 0)
#define  MG8_1_16PL    ~(1 << 5)
#else
#define  MG8_1_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_1PL) || (G8_7PL == 0)
#define  MG8_1_17PL    ~(1 << 6)
#else
#define  MG8_1_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_1PL) || (G8_8PL == 0)
#define  MG8_1_18PL    ~(1 << 7)
#else
#define  MG8_1_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_1PL) || (G8_9PL == 0)
#define  MG8_1_19PL    ~(1 << 8)
#else
#define  MG8_1_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_1PL) || (G8_10PL == 0)
#define  MG8_1_110PL    ~(1 << 9)
#else
#define  MG8_1_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_1PL) || (G8_11PL == 0)
#define  MG8_1_111PL    ~(1 << 10)
#else
#define  MG8_1_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_1PL) || (G8_12PL == 0)
#define  MG8_1_112PL    ~(1 << 11)
#else
#define  MG8_1_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_1PL) || (G8_13PL == 0)
#define  MG8_1_113PL    ~(1 << 12)
#else
#define  MG8_1_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_1PL) || (G8_14PL == 0)
#define  MG8_1_114PL    ~(1 << 13)
#else
#define  MG8_1_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_1PL) || (G8_15PL == 0)
#define  MG8_1_115PL    ~(1 << 14)
#else
#define  MG8_1_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_1PL) || (G8_16PL == 0)
#define  MG8_1_116PL    ~(1 << 15)
#else
#define  MG8_1_116PL    0xFFFF
#endif

#define  MG8_1_11PL    0xFFFE
#define  MG8_1    (MG8_1_11PL & MG8_1_12PL & MG8_1_13PL & MG8_1_14PL & \
                    MG8_1_15PL & MG8_1_16PL & MG8_1_17PL & MG8_1_18PL & \
                    MG8_1_19PL & MG8_1_110PL & MG8_1_111PL & MG8_1_112PL & \
                    MG8_1_113PL & MG8_1_114PL & MG8_1_115PL & MG8_1_116PL)
// End of MG8_1:
// Beginning of MG82:
#if (G8_1PL >= G8_2PL) || (G8_1PL == 0)
#define  MG8_2_11PL    ~(1 << 0)
#else
#define  MG8_2_11PL    0xFFFF
#endif

#if (G8_3PL >= G8_2PL) || (G8_3PL == 0)
#define  MG8_2_13PL    ~(1 << 2)
#else
#define  MG8_2_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_2PL) || (G8_4PL == 0)
#define  MG8_2_14PL    ~(1 << 3)
#else
#define  MG8_2_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_2PL) || (G8_5PL == 0)
#define  MG8_2_15PL    ~(1 << 4)
#else
#define  MG8_2_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_2PL) || (G8_6PL == 0)
#define  MG8_2_16PL    ~(1 << 5)
#else
#define  MG8_2_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_2PL) || (G8_7PL == 0)
#define  MG8_2_17PL    ~(1 << 6)
#else
#define  MG8_2_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_2PL) || (G8_8PL == 0)
#define  MG8_2_18PL    ~(1 << 7)
#else
#define  MG8_2_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_2PL) || (G8_9PL == 0)
#define  MG8_2_19PL    ~(1 << 8)
#else
#define  MG8_2_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_2PL) || (G8_10PL == 0)
#define  MG8_2_110PL    ~(1 << 9)
#else
#define  MG8_2_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_2PL) || (G8_11PL == 0)
#define  MG8_2_111PL    ~(1 << 10)
#else
#define  MG8_2_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_2PL) || (G8_12PL == 0)
#define  MG8_2_112PL    ~(1 << 11)
#else
#define  MG8_2_112PL    0xFFFF
#endif

