RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G8_13PL >= G8_2PL) || (G8_13PL == 0)
#define  MG8_2_113PL    ~(1 << 12)
#else
#define  MG8_2_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_2PL) || (G8_14PL == 0)
#define  MG8_2_114PL    ~(1 << 13)
#else
#define  MG8_2_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_2PL) || (G8_15PL == 0)
#define  MG8_2_115PL    ~(1 << 14)
#else
#define  MG8_2_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_2PL) || (G8_16PL == 0)
#define  MG8_2_116PL    ~(1 << 15)
#else
#define  MG8_2_116PL    0xFFFF
#endif

#define  MG8_2_12PL    0xFFFD
#define  MG8_2    (MG8_2_11PL & MG8_2_12PL & MG8_2_13PL & MG8_2_14PL & \
                    MG8_2_15PL & MG8_2_16PL & MG8_2_17PL & MG8_2_18PL & \
                    MG8_2_19PL & MG8_2_110PL & MG8_2_111PL & MG8_2_112PL & \
                    MG8_2_113PL & MG8_2_114PL & MG8_2_115PL & MG8_2_116PL)
// End of MG8_2:
// Beginning of MG83:
#if (G8_1PL >= G8_3PL) || (G8_1PL == 0)
#define  MG8_3_11PL    ~(1 << 0)
#else
#define  MG8_3_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_3PL) || (G8_2PL == 0)
#define  MG8_3_12PL    ~(1 << 1)
#else
#define  MG8_3_12PL    0xFFFF
#endif

#if (G8_4PL >= G8_3PL) || (G8_4PL == 0)
#define  MG8_3_14PL    ~(1 << 3)
#else
#define  MG8_3_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_3PL) || (G8_5PL == 0)
#define  MG8_3_15PL    ~(1 << 4)
#else
#define  MG8_3_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_3PL) || (G8_6PL == 0)
#define  MG8_3_16PL    ~(1 << 5)
#else
#define  MG8_3_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_3PL) || (G8_7PL == 0)
#define  MG8_3_17PL    ~(1 << 6)
#else
#define  MG8_3_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_3PL) || (G8_8PL == 0)
#define  MG8_3_18PL    ~(1 << 7)
#else
#define  MG8_3_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_3PL) || (G8_9PL == 0)
#define  MG8_3_19PL    ~(1 << 8)
#else
#define  MG8_3_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_3PL) || (G8_10PL == 0)
#define  MG8_3_110PL    ~(1 << 9)
#else
#define  MG8_3_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_3PL) || (G8_11PL == 0)
#define  MG8_3_111PL    ~(1 << 10)
#else
#define  MG8_3_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_3PL) || (G8_12PL == 0)
#define  MG8_3_112PL    ~(1 << 11)
#else
#define  MG8_3_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_3PL) || (G8_13PL == 0)
#define  MG8_3_113PL    ~(1 << 12)
#else
#define  MG8_3_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_3PL) || (G8_14PL == 0)
#define  MG8_3_114PL    ~(1 << 13)
#else
#define  MG8_3_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_3PL) || (G8_15PL == 0)
#define  MG8_3_115PL    ~(1 << 14)
#else
#define  MG8_3_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_3PL) || (G8_16PL == 0)
#define  MG8_3_116PL    ~(1 << 15)
#else
#define  MG8_3_116PL    0xFFFF
#endif

#define  MG8_3_13PL    0xFFFB
#define  MG8_3    (MG8_3_11PL & MG8_3_12PL & MG8_3_13PL & MG8_3_14PL & \
                    MG8_3_15PL & MG8_3_16PL & MG8_3_17PL & MG8_3_18PL & \
                    MG8_3_19PL & MG8_3_110PL & MG8_3_111PL & MG8_3_112PL & \
                    MG8_3_113PL & MG8_3_114PL & MG8_3_115PL & MG8_3_116PL)
// End of MG8_3:
// Beginning of MG84:
#if (G8_1PL >= G8_4PL) || (G8_1PL == 0)
#define  MG8_4_11PL    ~(1 << 0)
#else
#define  MG8_4_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_4PL) || (G8_2PL == 0)
#define  MG8_4_12PL    ~(1 << 1)
#else
#define  MG8_4_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_4PL) || (G8_3PL == 0)
#define  MG8_4_13PL    ~(1 << 2)
#else
#define  MG8_4_13PL    0xFFFF
#endif

#if (G8_5PL >= G8_4PL) || (G8_5PL == 0)
#define  MG8_4_15PL    ~(1 << 4)
#else
#define  MG8_4_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_4PL) || (G8_6PL == 0)
#define  MG8_4_16PL    ~(1 << 5)
#else
#define  MG8_4_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_4PL) || (G8_7PL == 0)
#define  MG8_4_17PL    ~(1 << 6)
#else
#define  MG8_4_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_4PL) || (G8_8PL == 0)
#define  MG8_4_18PL    ~(1 << 7)
#else
#define  MG8_4_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_4PL) || (G8_9PL == 0)
#define  MG8_4_19PL    ~(1 << 8)
#else
#define  MG8_4_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_4PL) || (G8_10PL == 0)
#define  MG8_4_110PL    ~(1 << 9)
#else
#define  MG8_4_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_4PL) || (G8_11PL == 0)
#define  MG8_4_111PL    ~(1 << 10)
#else
#define  MG8_4_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_4PL) || (G8_12PL == 0)
#define  MG8_4_112PL    ~(1 << 11)
#else
#define  MG8_4_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_4PL) || (G8_13PL == 0)
#define  MG8_4_113PL    ~(1 << 12)
#else
#define  MG8_4_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_4PL) || (G8_14PL == 0)
#define  MG8_4_114PL    ~(1 << 13)
#else
#define  MG8_4_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_4PL) || (G8_15PL == 0)
#define  MG8_4_115PL    ~(1 << 14)
#else
#define  MG8_4_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_4PL) || (G8_16PL == 0)
#define  MG8_4_116PL    ~(1 << 15)
#else
#define  MG8_4_116PL    0xFFFF
#endif

#define  MG8_4_14PL    0xFFF7
#define  MG8_4    (MG8_4_11PL & MG8_4_12PL & MG8_4_13PL & MG8_4_14PL & \
                    MG8_4_15PL & MG8_4_16PL & MG8_4_17PL & MG8_4_18PL & \
                    MG8_4_19PL & MG8_4_110PL & MG8_4_111PL & MG8_4_112PL & \
                    MG8_4_113PL & MG8_4_114PL & MG8_4_115PL & MG8_4_116PL)
// End of MG8_4:
// Beginning of MG85:
#if (G8_1PL >= G8_5PL) || (G8_1PL == 0)
#define  MG8_5_11PL    ~(1 << 0)
#else
#define  MG8_5_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_5PL) || (G8_2PL == 0)
#define  MG8_5_12PL    ~(1 << 1)
#else
#define  MG8_5_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_5PL) || (G8_3PL == 0)
#define  MG8_5_13PL    ~(1 << 2)
#else
#define  MG8_5_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_5PL) || (G8_4PL == 0)
#define  MG8_5_14PL    ~(1 << 3)
#else
#define  MG8_5_14PL    0xFFFF
#endif

#if (G8_6PL >= G8_5PL) || (G8_6PL == 0)
#define  MG8_5_16PL    ~(1 << 5)
#else
#define  MG8_5_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_5PL) || (G8_7PL == 0)
#define  MG8_5_17PL    ~(1 << 6)
#else
#define  MG8_5_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_5PL) || (G8_8PL == 0)
#define  MG8_5_18PL    ~(1 << 7)
#else
#define  MG8_5_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_5PL) || (G8_9PL == 0)
#define  MG8_5_19PL    ~(1 << 8)
#else
#define  MG8_5_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_5PL) || (G8_10PL == 0)
#define  MG8_5_110PL    ~(1 << 9)
#else
#define  MG8_5_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_5PL) || (G8_11PL == 0)
#define  MG8_5_111PL    ~(1 << 10)
#else
#define  MG8_5_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_5PL) || (G8_12PL == 0)
#define  MG8_5_112PL    ~(1 << 11)
#else
#define  MG8_5_112PL    0xFFFF
#endif

