RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G8_13PL >= G8_5PL) || (G8_13PL == 0)
#define  MG8_5_113PL    ~(1 << 12)
#else
#define  MG8_5_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_5PL) || (G8_14PL == 0)
#define  MG8_5_114PL    ~(1 << 13)
#else
#define  MG8_5_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_5PL) || (G8_15PL == 0)
#define  MG8_5_115PL    ~(1 << 14)
#else
#define  MG8_5_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_5PL) || (G8_16PL == 0)
#define  MG8_5_116PL    ~(1 << 15)
#else
#define  MG8_5_116PL    0xFFFF
#endif

#define  MG8_5_15PL    0xFFEF
#define  MG8_5    (MG8_5_11PL & MG8_5_12PL & MG8_5_13PL & MG8_5_14PL & \
                    MG8_5_15PL & MG8_5_16PL & MG8_5_17PL & MG8_5_18PL & \
                    MG8_5_19PL & MG8_5_110PL & MG8_5_111PL & MG8_5_112PL & \
                    MG8_5_113PL & MG8_5_114PL & MG8_5_115PL & MG8_5_116PL)
// End of MG8_5:
// Beginning of MG86:
#if (G8_1PL >= G8_6PL) || (G8_1PL == 0)
#define  MG8_6_11PL    ~(1 << 0)
#else
#define  MG8_6_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_6PL) || (G8_2PL == 0)
#define  MG8_6_12PL    ~(1 << 1)
#else
#define  MG8_6_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_6PL) || (G8_3PL == 0)
#define  MG8_6_13PL    ~(1 << 2)
#else
#define  MG8_6_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_6PL) || (G8_4PL == 0)
#define  MG8_6_14PL    ~(1 << 3)
#else
#define  MG8_6_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_6PL) || (G8_5PL == 0)
#define  MG8_6_15PL    ~(1 << 4)
#else
#define  MG8_6_15PL    0xFFFF
#endif

#if (G8_7PL >= G8_6PL) || (G8_7PL == 0)
#define  MG8_6_17PL    ~(1 << 6)
#else
#define  MG8_6_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_6PL) || (G8_8PL == 0)
#define  MG8_6_18PL    ~(1 << 7)
#else
#define  MG8_6_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_6PL) || (G8_9PL == 0)
#define  MG8_6_19PL    ~(1 << 8)
#else
#define  MG8_6_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_6PL) || (G8_10PL == 0)
#define  MG8_6_110PL    ~(1 << 9)
#else
#define  MG8_6_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_6PL) || (G8_11PL == 0)
#define  MG8_6_111PL    ~(1 << 10)
#else
#define  MG8_6_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_6PL) || (G8_12PL == 0)
#define  MG8_6_112PL    ~(1 << 11)
#else
#define  MG8_6_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_6PL) || (G8_13PL == 0)
#define  MG8_6_113PL    ~(1 << 12)
#else
#define  MG8_6_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_6PL) || (G8_14PL == 0)
#define  MG8_6_114PL    ~(1 << 13)
#else
#define  MG8_6_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_6PL) || (G8_15PL == 0)
#define  MG8_6_115PL    ~(1 << 14)
#else
#define  MG8_6_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_6PL) || (G8_16PL == 0)
#define  MG8_6_116PL    ~(1 << 15)
#else
#define  MG8_6_116PL    0xFFFF
#endif

#define  MG8_6_16PL    0xFFDF
#define  MG8_6    (MG8_6_11PL & MG8_6_12PL & MG8_6_13PL & MG8_6_14PL & \
                    MG8_6_15PL & MG8_6_16PL & MG8_6_17PL & MG8_6_18PL & \
                    MG8_6_19PL & MG8_6_110PL & MG8_6_111PL & MG8_6_112PL & \
                    MG8_6_113PL & MG8_6_114PL & MG8_6_115PL & MG8_6_116PL)
// End of MG8_6:
// Beginning of MG87:
#if (G8_1PL >= G8_7PL) || (G8_1PL == 0)
#define  MG8_7_11PL    ~(1 << 0)
#else
#define  MG8_7_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_7PL) || (G8_2PL == 0)
#define  MG8_7_12PL    ~(1 << 1)
#else
#define  MG8_7_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_7PL) || (G8_3PL == 0)
#define  MG8_7_13PL    ~(1 << 2)
#else
#define  MG8_7_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_7PL) || (G8_4PL == 0)
#define  MG8_7_14PL    ~(1 << 3)
#else
#define  MG8_7_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_7PL) || (G8_5PL == 0)
#define  MG8_7_15PL    ~(1 << 4)
#else
#define  MG8_7_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_7PL) || (G8_6PL == 0)
#define  MG8_7_16PL    ~(1 << 5)
#else
#define  MG8_7_16PL    0xFFFF
#endif

#if (G8_8PL >= G8_7PL) || (G8_8PL == 0)
#define  MG8_7_18PL    ~(1 << 7)
#else
#define  MG8_7_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_7PL) || (G8_9PL == 0)
#define  MG8_7_19PL    ~(1 << 8)
#else
#define  MG8_7_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_7PL) || (G8_10PL == 0)
#define  MG8_7_110PL    ~(1 << 9)
#else
#define  MG8_7_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_7PL) || (G8_11PL == 0)
#define  MG8_7_111PL    ~(1 << 10)
#else
#define  MG8_7_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_7PL) || (G8_12PL == 0)
#define  MG8_7_112PL    ~(1 << 11)
#else
#define  MG8_7_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_7PL) || (G8_13PL == 0)
#define  MG8_7_113PL    ~(1 << 12)
#else
#define  MG8_7_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_7PL) || (G8_14PL == 0)
#define  MG8_7_114PL    ~(1 << 13)
#else
#define  MG8_7_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_7PL) || (G8_15PL == 0)
#define  MG8_7_115PL    ~(1 << 14)
#else
#define  MG8_7_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_7PL) || (G8_16PL == 0)
#define  MG8_7_116PL    ~(1 << 15)
#else
#define  MG8_7_116PL    0xFFFF
#endif

#define  MG8_7_17PL    0xFFBF
#define  MG8_7    (MG8_7_11PL & MG8_7_12PL & MG8_7_13PL & MG8_7_14PL & \
                    MG8_7_15PL & MG8_7_16PL & MG8_7_17PL & MG8_7_18PL & \
                    MG8_7_19PL & MG8_7_110PL & MG8_7_111PL & MG8_7_112PL & \
                    MG8_7_113PL & MG8_7_114PL & MG8_7_115PL & MG8_7_116PL)
// End of MG8_7:
// Beginning of MG88:
#if (G8_1PL >= G8_8PL) || (G8_1PL == 0)
#define  MG8_8_11PL    ~(1 << 0)
#else
#define  MG8_8_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_8PL) || (G8_2PL == 0)
#define  MG8_8_12PL    ~(1 << 1)
#else
#define  MG8_8_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_8PL) || (G8_3PL == 0)
#define  MG8_8_13PL    ~(1 << 2)
#else
#define  MG8_8_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_8PL) || (G8_4PL == 0)
#define  MG8_8_14PL    ~(1 << 3)
#else
#define  MG8_8_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_8PL) || (G8_5PL == 0)
#define  MG8_8_15PL    ~(1 << 4)
#else
#define  MG8_8_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_8PL) || (G8_6PL == 0)
#define  MG8_8_16PL    ~(1 << 5)
#else
#define  MG8_8_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_8PL) || (G8_7PL == 0)
#define  MG8_8_17PL    ~(1 << 6)
#else
#define  MG8_8_17PL    0xFFFF
#endif

#if (G8_9PL >= G8_8PL) || (G8_9PL == 0)
#define  MG8_8_19PL    ~(1 << 8)
#else
#define  MG8_8_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_8PL) || (G8_10PL == 0)
#define  MG8_8_110PL    ~(1 << 9)
#else
#define  MG8_8_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_8PL) || (G8_11PL == 0)
#define  MG8_8_111PL    ~(1 << 10)
#else
#define  MG8_8_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_8PL) || (G8_12PL == 0)
#define  MG8_8_112PL    ~(1 << 11)
#else
#define  MG8_8_112PL    0xFFFF
#endif

