RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G9_13PL >= G9_1PL) || (G9_13PL == 0)
#define  MG9_1_113PL    ~(1 << 12)
#else
#define  MG9_1_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_1PL) || (G9_14PL == 0)
#define  MG9_1_114PL    ~(1 << 13)
#else
#define  MG9_1_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_1PL) || (G9_15PL == 0)
#define  MG9_1_115PL    ~(1 << 14)
#else
#define  MG9_1_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_1PL) || (G9_16PL == 0)
#define  MG9_1_116PL    ~(1 << 15)
#else
#define  MG9_1_116PL    0xFFFF
#endif

#define  MG9_1_11PL    0xFFFE
#define  MG9_1    (MG9_1_11PL & MG9_1_12PL & MG9_1_13PL & MG9_1_14PL & \
                    MG9_1_15PL & MG9_1_16PL & MG9_1_17PL & MG9_1_18PL & \
                    MG9_1_19PL & MG9_1_110PL & MG9_1_111PL & MG9_1_112PL & \
                    MG9_1_113PL & MG9_1_114PL & MG9_1_115PL & MG9_1_116PL)
// End of MG9_1:
// Beginning of MG92:
#if (G9_1PL >= G9_2PL) || (G9_1PL == 0)
#define  MG9_2_11PL    ~(1 << 0)
#else
#define  MG9_2_11PL    0xFFFF
#endif

#if (G9_3PL >= G9_2PL) || (G9_3PL == 0)
#define  MG9_2_13PL    ~(1 << 2)
#else
#define  MG9_2_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_2PL) || (G9_4PL == 0)
#define  MG9_2_14PL    ~(1 << 3)
#else
#define  MG9_2_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_2PL) || (G9_5PL == 0)
#define  MG9_2_15PL    ~(1 << 4)
#else
#define  MG9_2_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_2PL) || (G9_6PL == 0)
#define  MG9_2_16PL    ~(1 << 5)
#else
#define  MG9_2_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_2PL) || (G9_7PL == 0)
#define  MG9_2_17PL    ~(1 << 6)
#else
#define  MG9_2_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_2PL) || (G9_8PL == 0)
#define  MG9_2_18PL    ~(1 << 7)
#else
#define  MG9_2_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_2PL) || (G9_9PL == 0)
#define  MG9_2_19PL    ~(1 << 8)
#else
#define  MG9_2_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_2PL) || (G9_10PL == 0)
#define  MG9_2_110PL    ~(1 << 9)
#else
#define  MG9_2_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_2PL) || (G9_11PL == 0)
#define  MG9_2_111PL    ~(1 << 10)
#else
#define  MG9_2_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_2PL) || (G9_12PL == 0)
#define  MG9_2_112PL    ~(1 << 11)
#else
#define  MG9_2_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_2PL) || (G9_13PL == 0)
#define  MG9_2_113PL    ~(1 << 12)
#else
#define  MG9_2_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_2PL) || (G9_14PL == 0)
#define  MG9_2_114PL    ~(1 << 13)
#else
#define  MG9_2_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_2PL) || (G9_15PL == 0)
#define  MG9_2_115PL    ~(1 << 14)
#else
#define  MG9_2_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_2PL) || (G9_16PL == 0)
#define  MG9_2_116PL    ~(1 << 15)
#else
#define  MG9_2_116PL    0xFFFF
#endif

#define  MG9_2_12PL    0xFFFD
#define  MG9_2    (MG9_2_11PL & MG9_2_12PL & MG9_2_13PL & MG9_2_14PL & \
                    MG9_2_15PL & MG9_2_16PL & MG9_2_17PL & MG9_2_18PL & \
                    MG9_2_19PL & MG9_2_110PL & MG9_2_111PL & MG9_2_112PL & \
                    MG9_2_113PL & MG9_2_114PL & MG9_2_115PL & MG9_2_116PL)
// End of MG9_2:
// Beginning of MG93:
#if (G9_1PL >= G9_3PL) || (G9_1PL == 0)
#define  MG9_3_11PL    ~(1 << 0)
#else
#define  MG9_3_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_3PL) || (G9_2PL == 0)
#define  MG9_3_12PL    ~(1 << 1)
#else
#define  MG9_3_12PL    0xFFFF
#endif

#if (G9_4PL >= G9_3PL) || (G9_4PL == 0)
#define  MG9_3_14PL    ~(1 << 3)
#else
#define  MG9_3_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_3PL) || (G9_5PL == 0)
#define  MG9_3_15PL    ~(1 << 4)
#else
#define  MG9_3_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_3PL) || (G9_6PL == 0)
#define  MG9_3_16PL    ~(1 << 5)
#else
#define  MG9_3_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_3PL) || (G9_7PL == 0)
#define  MG9_3_17PL    ~(1 << 6)
#else
#define  MG9_3_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_3PL) || (G9_8PL == 0)
#define  MG9_3_18PL    ~(1 << 7)
#else
#define  MG9_3_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_3PL) || (G9_9PL == 0)
#define  MG9_3_19PL    ~(1 << 8)
#else
#define  MG9_3_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_3PL) || (G9_10PL == 0)
#define  MG9_3_110PL    ~(1 << 9)
#else
#define  MG9_3_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_3PL) || (G9_11PL == 0)
#define  MG9_3_111PL    ~(1 << 10)
#else
#define  MG9_3_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_3PL) || (G9_12PL == 0)
#define  MG9_3_112PL    ~(1 << 11)
#else
#define  MG9_3_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_3PL) || (G9_13PL == 0)
#define  MG9_3_113PL    ~(1 << 12)
#else
#define  MG9_3_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_3PL) || (G9_14PL == 0)
#define  MG9_3_114PL    ~(1 << 13)
#else
#define  MG9_3_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_3PL) || (G9_15PL == 0)
#define  MG9_3_115PL    ~(1 << 14)
#else
#define  MG9_3_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_3PL) || (G9_16PL == 0)
#define  MG9_3_116PL    ~(1 << 15)
#else
#define  MG9_3_116PL    0xFFFF
#endif

#define  MG9_3_13PL    0xFFFB
#define  MG9_3    (MG9_3_11PL & MG9_3_12PL & MG9_3_13PL & MG9_3_14PL & \
                    MG9_3_15PL & MG9_3_16PL & MG9_3_17PL & MG9_3_18PL & \
                    MG9_3_19PL & MG9_3_110PL & MG9_3_111PL & MG9_3_112PL & \
                    MG9_3_113PL & MG9_3_114PL & MG9_3_115PL & MG9_3_116PL)
// End of MG9_3:
// Beginning of MG94:
#if (G9_1PL >= G9_4PL) || (G9_1PL == 0)
#define  MG9_4_11PL    ~(1 << 0)
#else
#define  MG9_4_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_4PL) || (G9_2PL == 0)
#define  MG9_4_12PL    ~(1 << 1)
#else
#define  MG9_4_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_4PL) || (G9_3PL == 0)
#define  MG9_4_13PL    ~(1 << 2)
#else
#define  MG9_4_13PL    0xFFFF
#endif

#if (G9_5PL >= G9_4PL) || (G9_5PL == 0)
#define  MG9_4_15PL    ~(1 << 4)
#else
#define  MG9_4_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_4PL) || (G9_6PL == 0)
#define  MG9_4_16PL    ~(1 << 5)
#else
#define  MG9_4_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_4PL) || (G9_7PL == 0)
#define  MG9_4_17PL    ~(1 << 6)
#else
#define  MG9_4_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_4PL) || (G9_8PL == 0)
#define  MG9_4_18PL    ~(1 << 7)
#else
#define  MG9_4_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_4PL) || (G9_9PL == 0)
#define  MG9_4_19PL    ~(1 << 8)
#else
#define  MG9_4_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_4PL) || (G9_10PL == 0)
#define  MG9_4_110PL    ~(1 << 9)
#else
#define  MG9_4_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_4PL) || (G9_11PL == 0)
#define  MG9_4_111PL    ~(1 << 10)
#else
#define  MG9_4_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_4PL) || (G9_12PL == 0)
#define  MG9_4_112PL    ~(1 << 11)
#else
#define  MG9_4_112PL    0xFFFF
#endif

