RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G9_13PL >= G9_4PL) || (G9_13PL == 0)
#define  MG9_4_113PL    ~(1 << 12)
#else
#define  MG9_4_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_4PL) || (G9_14PL == 0)
#define  MG9_4_114PL    ~(1 << 13)
#else
#define  MG9_4_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_4PL) || (G9_15PL == 0)
#define  MG9_4_115PL    ~(1 << 14)
#else
#define  MG9_4_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_4PL) || (G9_16PL == 0)
#define  MG9_4_116PL    ~(1 << 15)
#else
#define  MG9_4_116PL    0xFFFF
#endif

#define  MG9_4_14PL    0xFFF7
#define  MG9_4    (MG9_4_11PL & MG9_4_12PL & MG9_4_13PL & MG9_4_14PL & \
                    MG9_4_15PL & MG9_4_16PL & MG9_4_17PL & MG9_4_18PL & \
                    MG9_4_19PL & MG9_4_110PL & MG9_4_111PL & MG9_4_112PL & \
                    MG9_4_113PL & MG9_4_114PL & MG9_4_115PL & MG9_4_116PL)
// End of MG9_4:
// Beginning of MG95:
#if (G9_1PL >= G9_5PL) || (G9_1PL == 0)
#define  MG9_5_11PL    ~(1 << 0)
#else
#define  MG9_5_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_5PL) || (G9_2PL == 0)
#define  MG9_5_12PL    ~(1 << 1)
#else
#define  MG9_5_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_5PL) || (G9_3PL == 0)
#define  MG9_5_13PL    ~(1 << 2)
#else
#define  MG9_5_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_5PL) || (G9_4PL == 0)
#define  MG9_5_14PL    ~(1 << 3)
#else
#define  MG9_5_14PL    0xFFFF
#endif

#if (G9_6PL >= G9_5PL) || (G9_6PL == 0)
#define  MG9_5_16PL    ~(1 << 5)
#else
#define  MG9_5_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_5PL) || (G9_7PL == 0)
#define  MG9_5_17PL    ~(1 << 6)
#else
#define  MG9_5_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_5PL) || (G9_8PL == 0)
#define  MG9_5_18PL    ~(1 << 7)
#else
#define  MG9_5_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_5PL) || (G9_9PL == 0)
#define  MG9_5_19PL    ~(1 << 8)
#else
#define  MG9_5_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_5PL) || (G9_10PL == 0)
#define  MG9_5_110PL    ~(1 << 9)
#else
#define  MG9_5_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_5PL) || (G9_11PL == 0)
#define  MG9_5_111PL    ~(1 << 10)
#else
#define  MG9_5_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_5PL) || (G9_12PL == 0)
#define  MG9_5_112PL    ~(1 << 11)
#else
#define  MG9_5_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_5PL) || (G9_13PL == 0)
#define  MG9_5_113PL    ~(1 << 12)
#else
#define  MG9_5_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_5PL) || (G9_14PL == 0)
#define  MG9_5_114PL    ~(1 << 13)
#else
#define  MG9_5_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_5PL) || (G9_15PL == 0)
#define  MG9_5_115PL    ~(1 << 14)
#else
#define  MG9_5_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_5PL) || (G9_16PL == 0)
#define  MG9_5_116PL    ~(1 << 15)
#else
#define  MG9_5_116PL    0xFFFF
#endif

#define  MG9_5_15PL    0xFFEF
#define  MG9_5    (MG9_5_11PL & MG9_5_12PL & MG9_5_13PL & MG9_5_14PL & \
                    MG9_5_15PL & MG9_5_16PL & MG9_5_17PL & MG9_5_18PL & \
                    MG9_5_19PL & MG9_5_110PL & MG9_5_111PL & MG9_5_112PL & \
                    MG9_5_113PL & MG9_5_114PL & MG9_5_115PL & MG9_5_116PL)
// End of MG9_5:
// Beginning of MG96:
#if (G9_1PL >= G9_6PL) || (G9_1PL == 0)
#define  MG9_6_11PL    ~(1 << 0)
#else
#define  MG9_6_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_6PL) || (G9_2PL == 0)
#define  MG9_6_12PL    ~(1 << 1)
#else
#define  MG9_6_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_6PL) || (G9_3PL == 0)
#define  MG9_6_13PL    ~(1 << 2)
#else
#define  MG9_6_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_6PL) || (G9_4PL == 0)
#define  MG9_6_14PL    ~(1 << 3)
#else
#define  MG9_6_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_6PL) || (G9_5PL == 0)
#define  MG9_6_15PL    ~(1 << 4)
#else
#define  MG9_6_15PL    0xFFFF
#endif

#if (G9_7PL >= G9_6PL) || (G9_7PL == 0)
#define  MG9_6_17PL    ~(1 << 6)
#else
#define  MG9_6_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_6PL) || (G9_8PL == 0)
#define  MG9_6_18PL    ~(1 << 7)
#else
#define  MG9_6_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_6PL) || (G9_9PL == 0)
#define  MG9_6_19PL    ~(1 << 8)
#else
#define  MG9_6_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_6PL) || (G9_10PL == 0)
#define  MG9_6_110PL    ~(1 << 9)
#else
#define  MG9_6_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_6PL) || (G9_11PL == 0)
#define  MG9_6_111PL    ~(1 << 10)
#else
#define  MG9_6_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_6PL) || (G9_12PL == 0)
#define  MG9_6_112PL    ~(1 << 11)
#else
#define  MG9_6_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_6PL) || (G9_13PL == 0)
#define  MG9_6_113PL    ~(1 << 12)
#else
#define  MG9_6_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_6PL) || (G9_14PL == 0)
#define  MG9_6_114PL    ~(1 << 13)
#else
#define  MG9_6_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_6PL) || (G9_15PL == 0)
#define  MG9_6_115PL    ~(1 << 14)
#else
#define  MG9_6_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_6PL) || (G9_16PL == 0)
#define  MG9_6_116PL    ~(1 << 15)
#else
#define  MG9_6_116PL    0xFFFF
#endif

#define  MG9_6_16PL    0xFFDF
#define  MG9_6    (MG9_6_11PL & MG9_6_12PL & MG9_6_13PL & MG9_6_14PL & \
                    MG9_6_15PL & MG9_6_16PL & MG9_6_17PL & MG9_6_18PL & \
                    MG9_6_19PL & MG9_6_110PL & MG9_6_111PL & MG9_6_112PL & \
                    MG9_6_113PL & MG9_6_114PL & MG9_6_115PL & MG9_6_116PL)
// End of MG9_6:
// Beginning of MG97:
#if (G9_1PL >= G9_7PL) || (G9_1PL == 0)
#define  MG9_7_11PL    ~(1 << 0)
#else
#define  MG9_7_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_7PL) || (G9_2PL == 0)
#define  MG9_7_12PL    ~(1 << 1)
#else
#define  MG9_7_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_7PL) || (G9_3PL == 0)
#define  MG9_7_13PL    ~(1 << 2)
#else
#define  MG9_7_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_7PL) || (G9_4PL == 0)
#define  MG9_7_14PL    ~(1 << 3)
#else
#define  MG9_7_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_7PL) || (G9_5PL == 0)
#define  MG9_7_15PL    ~(1 << 4)
#else
#define  MG9_7_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_7PL) || (G9_6PL == 0)
#define  MG9_7_16PL    ~(1 << 5)
#else
#define  MG9_7_16PL    0xFFFF
#endif

#if (G9_8PL >= G9_7PL) || (G9_8PL == 0)
#define  MG9_7_18PL    ~(1 << 7)
#else
#define  MG9_7_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_7PL) || (G9_9PL == 0)
#define  MG9_7_19PL    ~(1 << 8)
#else
#define  MG9_7_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_7PL) || (G9_10PL == 0)
#define  MG9_7_110PL    ~(1 << 9)
#else
#define  MG9_7_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_7PL) || (G9_11PL == 0)
#define  MG9_7_111PL    ~(1 << 10)
#else
#define  MG9_7_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_7PL) || (G9_12PL == 0)
#define  MG9_7_112PL    ~(1 << 11)
#else
#define  MG9_7_112PL    0xFFFF
#endif

