RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#define  MG9_10_110PL    0xFDFF
#define  MG9_10    (MG9_10_11PL & MG9_10_12PL & MG9_10_13PL & MG9_10_14PL & \
                    MG9_10_15PL & MG9_10_16PL & MG9_10_17PL & MG9_10_18PL & \
                    MG9_10_19PL & MG9_10_110PL & MG9_10_111PL & MG9_10_112PL & \
                    MG9_10_113PL & MG9_10_114PL & MG9_10_115PL & MG9_10_116PL)
// End of MG9_10:
// Beginning of MG911:
#if (G9_1PL >= G9_11PL) || (G9_1PL == 0)
#define  MG9_11_11PL    ~(1 << 0)
#else
#define  MG9_11_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_11PL) || (G9_2PL == 0)
#define  MG9_11_12PL    ~(1 << 1)
#else
#define  MG9_11_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_11PL) || (G9_3PL == 0)
#define  MG9_11_13PL    ~(1 << 2)
#else
#define  MG9_11_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_11PL) || (G9_4PL == 0)
#define  MG9_11_14PL    ~(1 << 3)
#else
#define  MG9_11_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_11PL) || (G9_5PL == 0)
#define  MG9_11_15PL    ~(1 << 4)
#else
#define  MG9_11_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_11PL) || (G9_6PL == 0)
#define  MG9_11_16PL    ~(1 << 5)
#else
#define  MG9_11_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_11PL) || (G9_7PL == 0)
#define  MG9_11_17PL    ~(1 << 6)
#else
#define  MG9_11_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_11PL) || (G9_8PL == 0)
#define  MG9_11_18PL    ~(1 << 7)
#else
#define  MG9_11_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_11PL) || (G9_9PL == 0)
#define  MG9_11_19PL    ~(1 << 8)
#else
#define  MG9_11_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_11PL) || (G9_10PL == 0)
#define  MG9_11_110PL    ~(1 << 9)
#else
#define  MG9_11_110PL    0xFFFF
#endif

#if (G9_12PL >= G9_11PL) || (G9_12PL == 0)
#define  MG9_11_112PL    ~(1 << 11)
#else
#define  MG9_11_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_11PL) || (G9_13PL == 0)
#define  MG9_11_113PL    ~(1 << 12)
#else
#define  MG9_11_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_11PL) || (G9_14PL == 0)
#define  MG9_11_114PL    ~(1 << 13)
#else
#define  MG9_11_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_11PL) || (G9_15PL == 0)
#define  MG9_11_115PL    ~(1 << 14)
#else
#define  MG9_11_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_11PL) || (G9_16PL == 0)
#define  MG9_11_116PL    ~(1 << 15)
#else
#define  MG9_11_116PL    0xFFFF
#endif

#define  MG9_11_111PL    0xFBFF
#define  MG9_11    (MG9_11_11PL & MG9_11_12PL & MG9_11_13PL & MG9_11_14PL & \
                    MG9_11_15PL & MG9_11_16PL & MG9_11_17PL & MG9_11_18PL & \
                    MG9_11_19PL & MG9_11_110PL & MG9_11_111PL & MG9_11_112PL & \
                    MG9_11_113PL & MG9_11_114PL & MG9_11_115PL & MG9_11_116PL)
// End of MG9_11:
// Beginning of MG912:
#if (G9_1PL >= G9_12PL) || (G9_1PL == 0)
#define  MG9_12_11PL    ~(1 << 0)
#else
#define  MG9_12_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_12PL) || (G9_2PL == 0)
#define  MG9_12_12PL    ~(1 << 1)
#else
#define  MG9_12_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_12PL) || (G9_3PL == 0)
#define  MG9_12_13PL    ~(1 << 2)
#else
#define  MG9_12_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_12PL) || (G9_4PL == 0)
#define  MG9_12_14PL    ~(1 << 3)
#else
#define  MG9_12_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_12PL) || (G9_5PL == 0)
#define  MG9_12_15PL    ~(1 << 4)
#else
#define  MG9_12_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_12PL) || (G9_6PL == 0)
#define  MG9_12_16PL    ~(1 << 5)
#else
#define  MG9_12_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_12PL) || (G9_7PL == 0)
#define  MG9_12_17PL    ~(1 << 6)
#else
#define  MG9_12_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_12PL) || (G9_8PL == 0)
#define  MG9_12_18PL    ~(1 << 7)
#else
#define  MG9_12_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_12PL) || (G9_9PL == 0)
#define  MG9_12_19PL    ~(1 << 8)
#else
#define  MG9_12_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_12PL) || (G9_10PL == 0)
#define  MG9_12_110PL    ~(1 << 9)
#else
#define  MG9_12_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_12PL) || (G9_11PL == 0)
#define  MG9_12_111PL    ~(1 << 10)
#else
#define  MG9_12_111PL    0xFFFF
#endif

#if (G9_13PL >= G9_12PL) || (G9_13PL == 0)
#define  MG9_12_113PL    ~(1 << 12)
#else
#define  MG9_12_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_12PL) || (G9_14PL == 0)
#define  MG9_12_114PL    ~(1 << 13)
#else
#define  MG9_12_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_12PL) || (G9_15PL == 0)
#define  MG9_12_115PL    ~(1 << 14)
#else
#define  MG9_12_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_12PL) || (G9_16PL == 0)
#define  MG9_12_116PL    ~(1 << 15)
#else
#define  MG9_12_116PL    0xFFFF
#endif

#define  MG9_12_112PL    0xF7FF
#define  MG9_12    (MG9_12_11PL & MG9_12_12PL & MG9_12_13PL & MG9_12_14PL & \
                    MG9_12_15PL & MG9_12_16PL & MG9_12_17PL & MG9_12_18PL & \
                    MG9_12_19PL & MG9_12_110PL & MG9_12_111PL & MG9_12_112PL & \
                    MG9_12_113PL & MG9_12_114PL & MG9_12_115PL & MG9_12_116PL)
// End of MG9_12:
// Beginning of MG913:
#if (G9_1PL >= G9_13PL) || (G9_1PL == 0)
#define  MG9_13_11PL    ~(1 << 0)
#else
#define  MG9_13_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_13PL) || (G9_2PL == 0)
#define  MG9_13_12PL    ~(1 << 1)
#else
#define  MG9_13_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_13PL) || (G9_3PL == 0)
#define  MG9_13_13PL    ~(1 << 2)
#else
#define  MG9_13_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_13PL) || (G9_4PL == 0)
#define  MG9_13_14PL    ~(1 << 3)
#else
#define  MG9_13_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_13PL) || (G9_5PL == 0)
#define  MG9_13_15PL    ~(1 << 4)
#else
#define  MG9_13_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_13PL) || (G9_6PL == 0)
#define  MG9_13_16PL    ~(1 << 5)
#else
#define  MG9_13_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_13PL) || (G9_7PL == 0)
#define  MG9_13_17PL    ~(1 << 6)
#else
#define  MG9_13_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_13PL) || (G9_8PL == 0)
#define  MG9_13_18PL    ~(1 << 7)
#else
#define  MG9_13_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_13PL) || (G9_9PL == 0)
#define  MG9_13_19PL    ~(1 << 8)
#else
#define  MG9_13_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_13PL) || (G9_10PL == 0)
#define  MG9_13_110PL    ~(1 << 9)
#else
#define  MG9_13_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_13PL) || (G9_11PL == 0)
#define  MG9_13_111PL    ~(1 << 10)
#else
#define  MG9_13_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_13PL) || (G9_12PL == 0)
#define  MG9_13_112PL    ~(1 << 11)
#else
#define  MG9_13_112PL    0xFFFF
#endif

#if (G9_14PL >= G9_13PL) || (G9_14PL == 0)
#define  MG9_13_114PL    ~(1 << 13)
#else
#define  MG9_13_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_13PL) || (G9_15PL == 0)
#define  MG9_13_115PL    ~(1 << 14)
#else
#define  MG9_13_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_13PL) || (G9_16PL == 0)
#define  MG9_13_116PL    ~(1 << 15)
#else
#define  MG9_13_116PL    0xFFFF
#endif

#define  MG9_13_113PL    0xEFFF
#define  MG9_13    (MG9_13_11PL & MG9_13_12PL & MG9_13_13PL & MG9_13_14PL & \
                    MG9_13_15PL & MG9_13_16PL & MG9_13_17PL & MG9_13_18PL & \
                    MG9_13_19PL & MG9_13_110PL & MG9_13_111PL & MG9_13_112PL & \
                    MG9_13_113PL & MG9_13_114PL & MG9_13_115PL & MG9_13_116PL)
// End of MG9_13:
// Beginning of MG914:
#if (G9_1PL >= G9_14PL) || (G9_1PL == 0)
#define  MG9_14_11PL    ~(1 << 0)
#else
#define  MG9_14_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_14PL) || (G9_2PL == 0)
#define  MG9_14_12PL    ~(1 << 1)
#else
#define  MG9_14_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_14PL) || (G9_3PL == 0)
#define  MG9_14_13PL    ~(1 << 2)
#else
#define  MG9_14_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_14PL) || (G9_4PL == 0)
#define  MG9_14_14PL    ~(1 << 3)
#else
#define  MG9_14_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_14PL) || (G9_5PL == 0)
#define  MG9_14_15PL    ~(1 << 4)
#else
#define  MG9_14_15PL    0xFFFF
#endif

