RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/include/F2837xD_SWPrioritizedIsrLevels.h
#if (G9_6PL >= G9_14PL) || (G9_6PL == 0)
#define  MG9_14_16PL    ~(1 << 5)
#else
#define  MG9_14_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_14PL) || (G9_7PL == 0)
#define  MG9_14_17PL    ~(1 << 6)
#else
#define  MG9_14_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_14PL) || (G9_8PL == 0)
#define  MG9_14_18PL    ~(1 << 7)
#else
#define  MG9_14_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_14PL) || (G9_9PL == 0)
#define  MG9_14_19PL    ~(1 << 8)
#else
#define  MG9_14_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_14PL) || (G9_10PL == 0)
#define  MG9_14_110PL    ~(1 << 9)
#else
#define  MG9_14_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_14PL) || (G9_11PL == 0)
#define  MG9_14_111PL    ~(1 << 10)
#else
#define  MG9_14_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_14PL) || (G9_12PL == 0)
#define  MG9_14_112PL    ~(1 << 11)
#else
#define  MG9_14_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_14PL) || (G9_13PL == 0)
#define  MG9_14_113PL    ~(1 << 12)
#else
#define  MG9_14_113PL    0xFFFF
#endif

#if (G9_15PL >= G9_14PL) || (G9_15PL == 0)
#define  MG9_14_115PL    ~(1 << 14)
#else
#define  MG9_14_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_14PL) || (G9_16PL == 0)
#define  MG9_14_116PL    ~(1 << 15)
#else
#define  MG9_14_116PL    0xFFFF
#endif

#define  MG9_14_114PL    0xDFFF
#define  MG9_14    (MG9_14_11PL & MG9_14_12PL & MG9_14_13PL & MG9_14_14PL & \
                    MG9_14_15PL & MG9_14_16PL & MG9_14_17PL & MG9_14_18PL & \
                    MG9_14_19PL & MG9_14_110PL & MG9_14_111PL & MG9_14_112PL & \
                    MG9_14_113PL & MG9_14_114PL & MG9_14_115PL & MG9_14_116PL)
// End of MG9_14:
// Beginning of MG915:
#if (G9_1PL >= G9_15PL) || (G9_1PL == 0)
#define  MG9_15_11PL    ~(1 << 0)
#else
#define  MG9_15_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_15PL) || (G9_2PL == 0)
#define  MG9_15_12PL    ~(1 << 1)
#else
#define  MG9_15_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_15PL) || (G9_3PL == 0)
#define  MG9_15_13PL    ~(1 << 2)
#else
#define  MG9_15_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_15PL) || (G9_4PL == 0)
#define  MG9_15_14PL    ~(1 << 3)
#else
#define  MG9_15_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_15PL) || (G9_5PL == 0)
#define  MG9_15_15PL    ~(1 << 4)
#else
#define  MG9_15_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_15PL) || (G9_6PL == 0)
#define  MG9_15_16PL    ~(1 << 5)
#else
#define  MG9_15_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_15PL) || (G9_7PL == 0)
#define  MG9_15_17PL    ~(1 << 6)
#else
#define  MG9_15_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_15PL) || (G9_8PL == 0)
#define  MG9_15_18PL    ~(1 << 7)
#else
#define  MG9_15_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_15PL) || (G9_9PL == 0)
#define  MG9_15_19PL    ~(1 << 8)
#else
#define  MG9_15_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_15PL) || (G9_10PL == 0)
#define  MG9_15_110PL    ~(1 << 9)
#else
#define  MG9_15_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_15PL) || (G9_11PL == 0)
#define  MG9_15_111PL    ~(1 << 10)
#else
#define  MG9_15_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_15PL) || (G9_12PL == 0)
#define  MG9_15_112PL    ~(1 << 11)
#else
#define  MG9_15_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_15PL) || (G9_13PL == 0)
#define  MG9_15_113PL    ~(1 << 12)
#else
#define  MG9_15_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_15PL) || (G9_14PL == 0)
#define  MG9_15_114PL    ~(1 << 13)
#else
#define  MG9_15_114PL    0xFFFF
#endif

#if (G9_16PL >= G9_15PL) || (G9_16PL == 0)
#define  MG9_15_116PL    ~(1 << 15)
#else
#define  MG9_15_116PL    0xFFFF
#endif

#define  MG9_15_115PL    0xBFFF
#define  MG9_15    (MG9_15_11PL & MG9_15_12PL & MG9_15_13PL & MG9_15_14PL & \
                    MG9_15_15PL & MG9_15_16PL & MG9_15_17PL & MG9_15_18PL & \
                    MG9_15_19PL & MG9_15_110PL & MG9_15_111PL & MG9_15_112PL & \
                    MG9_15_113PL & MG9_15_114PL & MG9_15_115PL & MG9_15_116PL)
// End of MG9_15:
// Beginning of MG916:
#if (G9_1PL >= G9_16PL) || (G9_1PL == 0)
#define  MG9_16_11PL    ~(1 << 0)
#else
#define  MG9_16_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_16PL) || (G9_2PL == 0)
#define  MG9_16_12PL    ~(1 << 1)
#else
#define  MG9_16_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_16PL) || (G9_3PL == 0)
#define  MG9_16_13PL    ~(1 << 2)
#else
#define  MG9_16_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_16PL) || (G9_4PL == 0)
#define  MG9_16_14PL    ~(1 << 3)
#else
#define  MG9_16_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_16PL) || (G9_5PL == 0)
#define  MG9_16_15PL    ~(1 << 4)
#else
#define  MG9_16_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_16PL) || (G9_6PL == 0)
#define  MG9_16_16PL    ~(1 << 5)
#else
#define  MG9_16_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_16PL) || (G9_7PL == 0)
#define  MG9_16_17PL    ~(1 << 6)
#else
#define  MG9_16_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_16PL) || (G9_8PL == 0)
#define  MG9_16_18PL    ~(1 << 7)
#else
#define  MG9_16_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_16PL) || (G9_9PL == 0)
#define  MG9_16_19PL    ~(1 << 8)
#else
#define  MG9_16_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_16PL) || (G9_10PL == 0)
#define  MG9_16_110PL    ~(1 << 9)
#else
#define  MG9_16_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_16PL) || (G9_11PL == 0)
#define  MG9_16_111PL    ~(1 << 10)
#else
#define  MG9_16_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_16PL) || (G9_12PL == 0)
#define  MG9_16_112PL    ~(1 << 11)
#else
#define  MG9_16_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_16PL) || (G9_13PL == 0)
#define  MG9_16_113PL    ~(1 << 12)
#else
#define  MG9_16_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_16PL) || (G9_14PL == 0)
#define  MG9_16_114PL    ~(1 << 13)
#else
#define  MG9_16_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_16PL) || (G9_15PL == 0)
#define  MG9_16_115PL    ~(1 << 14)
#else
#define  MG9_16_115PL    0xFFFF
#endif

#define  MG9_16_116PL    0x7FFF
#define  MG9_16    (MG9_16_11PL & MG9_16_12PL & MG9_16_13PL & MG9_16_14PL & \
                    MG9_16_15PL & MG9_16_16PL & MG9_16_17PL & MG9_16_18PL & \
                    MG9_16_19PL & MG9_16_110PL & MG9_16_111PL & MG9_16_112PL & \
                    MG9_16_113PL & MG9_16_114PL & MG9_16_115PL & MG9_16_116PL)
// End of MG9_16:


//
// Automatically generate PIEIER10 interrupt masks MG101 to MG1016:
//

// Beginning of MG101:
#if (G10_2PL >= G10_1PL) || (G10_2PL == 0)
#define  MG10_1_12PL    ~(1 << 1)
#else
#define  MG10_1_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_1PL) || (G10_3PL == 0)
#define  MG10_1_13PL    ~(1 << 2)
#else
#define  MG10_1_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_1PL) || (G10_4PL == 0)
#define  MG10_1_14PL    ~(1 << 3)
#else
#define  MG10_1_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_1PL) || (G10_5PL == 0)
#define  MG10_1_15PL    ~(1 << 4)
#else
#define  MG10_1_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_1PL) || (G10_6PL == 0)
#define  MG10_1_16PL    ~(1 << 5)
#else
#define  MG10_1_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_1PL) || (G10_7PL == 0)
#define  MG10_1_17PL    ~(1 << 6)
#else
#define  MG10_1_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_1PL) || (G10_8PL == 0)
#define  MG10_1_18PL    ~(1 << 7)
#else
#define  MG10_1_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_1PL) || (G10_9PL == 0)
#define  MG10_1_19PL    ~(1 << 8)
#else
#define  MG10_1_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_1PL) || (G10_10PL == 0)
#define  MG10_1_110PL    ~(1 << 9)
#else
#define  MG10_1_110PL    0xFFFF
#endif

